Repository: atmoswing/atmoswing
Catalog: locales/*/app_viewer_gui.po
Languages: fr

source: Value
fr: Valeur

source: Ratio P/P2
fr: Rapport P/P2

source: Ratio P/P5
fr: Rapport P/P5

source: Ratio P/P10
fr: Rapport P/P10

source: Ratio P/P20
fr: Rapport P/P20

source: Ratio P/P50
fr: Rapport P/P50

source: Ratio P/P100
fr: Rapport P/P100

source: Ratio P/P200
fr: Rapport P/P200

source: Ratio P/P300
fr: Rapport P/P300

source: Ratio P/P500
fr: Rapport P/P500

source: Selected display : %s.
fr: Affichage sélectionné : %s.

source: Selected quantile : %s.
fr: Quantile sélectionné : %s.

source: Forecast - specific
fr: Prévisions - spécifique

source: Forecast - other
fr: Prévisions - autre

source: The desired reference value is not available in the forecast file.
fr: La valeur de référence souhaitée n'est pas disponible dans le fichier de prévision.

source: %s is not associated to any forecast
fr: %s n'est associé à aucune prévision

source: Lead time not available for this forecast.
fr: L'échéance n'est pas disponible pour cette prévision.

source: Analogs details
fr: Détails des analogues

source: Distribution plots
fr: Graphiques des distributions

source: All analogs (points)
fr: Tous les analogues (points)

source: All analogs (curve)
fr: Tous les analogues (courbe)

source: 10 best analogs (points)
fr: 10 meilleures analogues (points)

source: 10 best analogs (curve)
fr: 10 meilleures analogues (courbe)

source: 5 best analogs (points)
fr: 5 meilleures analogues (points)

source: 5 best analogs (curve)
fr: 5 meilleures analogues (courbe)

source: 10 year return period
fr: Période de retour de 10 ans

source: All return periods
fr: Toutes les périodes de retour

source: Precipitation [mm]
fr: Précipitations [mm]

source: Cumulative frequency
fr: Fréquence cumulée

source: Analogs precipitation distribution
fr: Distribution des precipitations analogues

source: Criteria of analogy
fr: Critère d'analogie

source: Criteria distribution
fr: Distribution du critère

source: The forecast contains NaNs. Plotting has been canceled.
fr: La prévision contient des NaN. La creation du graphique a été annulée.

source: The option was not found.
fr: L'option n'a pas été trouvée.

source: The forecast criteria contains NaNs. Plotting has been canceled.
fr: Le critère de prévision contient des NaNs. La creation du graphique a été annulée.

source: The return periods couldn't be added to the plot
fr: Les périodes de retour n'ont pas pu être ajoutées au graphique

source: The 10 year return period was not found in the data.
fr: La période de retour de 10 ans n'a pas été trouvée dans les données.

source: The analogs data couldn't be added to the plot
fr: Les données analogues n'ont pas pu être ajoutées au graphique

source: All analogs
fr: Tous les analogues

source: 5 first analogs
fr: 5 premières analogues

source: 10 first analogs
fr: 10 premières analogues

source: The quantiles couldn't be added to the plot
fr: Les quantiles n'ont pas pu être ajoutés au graphique

source: Forecast plots
fr: Graphiques des prévisions

source: All quantiles
fr: Tous les quantiles

source: 10 best analogs
fr: 10 meilleures analogues

source: 5 best analogs
fr: 5 meilleures analogues

source: Previous forecasts
fr: Prévisions précédentes

source: Forecasted time series
fr: Série temporelle prévue

source: The interpretation curve couldn't be added to the plot
fr: La courbe d'interprétation n'a pas pu être ajoutée au graphique

source: Predictors overview
fr: Aperçu des prédicteurs

source: Zoom in
fr: Agrandir

source: Zoom out
fr: Réduire

source: Pan the map
fr: Déplacer la carte

source: Move the map by panning
fr: Déplacer la carte

source: Zoom to visible layers
fr: Zoom sur les couches visibles

source: Zoom view to the full extent of all visible layers
fr: Zoom sur l'ensemble des couches visibles

source: Display a cross marker overlay
fr: Afficher un marqueur en surimpression

source: Display a cross marker overlay on both frames
fr: Affichage d'un marqueur en surimpression sur les deux fenêtres

source: Preferences
fr: Préférences

source: Synchronize tools
fr: Synchroniser les outils

source: When set to true, browsing is synchronized on all display
fr: Lorsque activé, la navigation est synchronisée sur tous les panneaux

source: The Continents layer file %s cound not be opened.
fr: Le fichier de la couche Continents %s ne peut pas être ouvert.

source: The Continents layer file %s cound not be found.
fr: Le fichier de la couche Continents %s est introuvable.

source: The LatLong layer file %s cound not be opened.
fr: Le fichier de couche LatLong %s ne peut pas être ouvert.

source: The LatLong layer file %s cound not be found.
fr: Le fichier de couche LatLong %s est introuvable.

source: The Geogrid layer file %s cound not be opened.
fr: Le fichier de couche Geogrid %s ne peut pas être ouvert.

source: The Geogrid layer file %s cound not be found.
fr: Le fichier de couche Geogrid %s est introuvable.

source: The Countries layer file %s cound not be opened.
fr: Le fichier de la couche Countries %s ne peut pas être ouvert.

source: The Countries layer file %s cound not be found.
fr: Le fichier de la couche Countries %s est introuvable.

source: The layer could not be opened.
fr: La couche n'a pas pu être ouverte.

source: Select GIS layers
fr: Sélectionner les couches SIG

source: Nothing selected, no layer will be closed.
fr: Rien n'est sélectionné, aucune couche ne sera fermée.

source: Only forecasts of AtmoSwing 3+ can be visualized here.
fr: Seules les prévisions d'AtmoSwing 3+ peuvent être visualisées ici.

source: Failed to create transformation object (from %s).
fr: Échec de la création d'un objet de transformation (à partir de %s).

source: Open recent
fr: Ouvrir récent

source: Open forecast
fr: Ouvrir une prévision

source: Open a forecast
fr: Ouvrir une prévision

source: Select
fr: Sélectionner

source: Select data on the map
fr: Sélectionner des données sur la carte

source: Open distributions plots
fr: Ouvrir les diagrammes des distributions

source: Open analogs list
fr: Ouvrir la liste des analogues

source: Open predictor maps
fr: Ouvrir les cartes des prédicteurs

source: Welcome to AtmoSwing
fr: Bienvenue dans AtmoSwing

source: Killing the forecast running process.
fr: Arrêt du processus de la prévision.

source: The forecast process has been killed successfully.
fr: Le processus de prévision a été interrompu avec succès.

source: The forecast process couldn't be killed (bad signal).
fr: Le processus de prévision n'a pas pu être interrompu (bad signal).

source: The forecast process couldn't be killed (access denied).
fr: Le processus de prévision n'a pas pu être interrompu (access denied).

source: The forecast process couldn't be killed (no process).
fr: Le processus de prévision n'a pas pu être interrompu (no process).

source: The forecast process couldn't be killed (error).
fr: Le processus de prévision n'a pas pu être interrompu (erreur).

source: Failed to open the workspace file
fr: Échec de l'ouverture du fichier de l'espace de travail

source: Select a workspace
fr: Sélectionner un espace de travail

source: Select a path to save the workspace
fr: Sélectionnez un chemin d'accès pour enregistrer l'espace de travail

source: Could not save the workspace.
fr: Impossible de sauvegarder l'espace de travail.

source: The GIS layer type %s does not correspond to allowed values.
fr: Le type de couche SIG %s ne correspond pas aux valeurs autorisées.

source: The file %s cound not be opened.
fr: Le fichier %s ne peut pas être ouvert.

source: The file %s cound not be found.
fr: Le fichier %s est introuvable.

source: Welcome to AtmoSwing %s | Workspace: %s
fr: Bienvenue dans AtmoSwing %s | Espace de travail: %s

source: No layer opened, nothing to close.
fr: Aucune couche ouverte, rien à fermer.

source: Select Layer(s) to close.
fr: Sélectionnez le(s) couche(s) à fermer.

source: Close layer(s)
fr: Fermer la (les) couche(s)

source: Select a forecast file
fr: Sélectionner un fichier de prévisions

source: List of the forecasts not found.
fr: Liste des prévisions non trouvée.

source: The directory containing the forecasts was not provided.
fr: Le répertoire contenant les prévisions n'a pas été fourni.

source: The directory that is supposed to contain the forecasts does not exist.
fr: Le répertoire censé contenir les prévisions n'existe pas.

source: No recent forecast was found under %s
fr: Aucune prévision récente n'a été trouvée sous %s

source: A file with an unconventional name was found in the forecasts directory.
fr: Un fichier portant un nom non conventionnel a été trouvé dans le répertoire des prévisions.

source: Error when parsing the date: %s
fr: Erreur lors de l'interprétation de la date : %s

source: Failed to open the forecasts.
fr: Erreur à l'ouverture des prévisions.

source: No previous/next forecast was found under %s
fr: Aucune prévision précédente/suivante n'a été trouvée sous %s

source: A forecast file could not be opened (%s).
fr: Un fichier de prévision n'a pas pu être ouvert (%s).

source: The forecasts layer was not found.
fr: La couche de prévisions n'a pas été trouvée.

source: Moving layer not possible with less than 2 layers
fr: Le déplacement d'une couche n'est pas possible avec moins de 2 couches

source: No layer selected, select a layer first
fr: Aucune couche n'est sélectionnée, sélectionner d'abord une couche

source: Move layer to following position
fr: Déplacer le calque à la position suivante

source: The desired layer was not found.
fr: La couche souhaitée n'a pas été trouvée.

source: Error converting point : %d, %d to real coordinate
fr: Erreur de conversion du point : %d, %d en coordonnées réelles

source: Forecast of the %sh
fr: Prévision du %sh

source: Combination of sub-daily time steps not yet implemented.
fr: La combinaison de pas de temps infra-quotidiens n'a pas encore été mise en œuvre.

source: Too small time steps are not supported in the lead time switcher.
fr: Les pas de temps trop petits ne sont pas pris en charge actuellement.

source: Root
fr: Racine

source: X Axis
fr: Axe X

source: Y Axis
fr: Axe Y

source: Title
fr: Titre

source: The svg DC is not OK.
fr: Le DC svg n'est pas OK.

source: Alarms
fr: Alarmes

source: Alarms (T=%d, q=%g)
fr: Alarmes (T=%d, q=%g)

source: Too small time steps are not supported in the alarms panel.
fr: Les pas de temps trop petits ne sont pas pris en charge dans le panneau des alarmes.

source: Incorrect mode for the alarm panel.
fr: Mode incorrect pour le panneau d'alarme.

source: Analog dates
fr: Dates analogues

source: Analog
fr: Analogue

source: Criteria
fr: Critères

source: Forecast caption
fr: Légende des prévisions

source: No rainfall
fr: Pas de précipitations

source: Missing data
fr: Données manquantes

source: Forecasts
fr: Prévisions

source: GIS layers
fr: Couches SIG

source: Station selection
fr: Sélection d'une station

source: Bad allocation caught during data loading: %s
fr: Mauvaise allocation détectée lors du chargement des données : %s

source: Exception caught during data loading: %s
fr: Exception lors du chargement des données : %s

source: Predictor - target
fr: Prédicteur - cible

source: Contours - target
fr: Isohypses - cible

source: Spatial window (left)
fr: Fenêtre spatiale (gauche)

source: Location (left)
fr: Localisation (gauche)

source: Predictor - analog
fr: Prédicteur - analogue

source: Contours - analog
fr: Isohypses - analogue

source: Spatial window (right)
fr: Fenêtre spatiale (droite)

source: Location (right)
fr: Localisation (droite)

source: Workspace creation wizard
fr: Assistant de création d'espace de travail

source: Incorrect base map selection.
fr: Sélection incorrecte de la carte de base.

source: Cannot find file %s
fr: Impossible de trouver le fichier %s

source: Welcome to AtmoSwing %s.
fr: Bienvenue dans AtmoSwing %s.

source: AtmoSwing log window
fr: Fenêtre du journal AtmoSwing

source: No forecast opened
fr: Aucune prévision n'a été ouverte

source: No forecast selected
fr: Aucune prévision sélectionnée

source: Open a workspace
fr: Ouvrir un espace de travail

source: Save the workspace
fr: Sauvegarder l'espace de travail

source: Save the workspace as
fr: Enregistrer l'espace de travail sous

source: Create a new workspace
fr: Créer un nouvel espace de travail

source: Open a forecast file
fr: Ouvrir un fichier de prévisions

source: Open a GIS layer
fr: Ouvrir une couche SIG

source: Close a GIS layer
fr: Fermer une couche SIG

source: Move the selected layer
fr: Déplacer la couche sélectionnée

source: Quit
fr: Quitter

source: File
fr: Fichier

source: Build predictand DB
fr: Construire la base de données des prédictants

source: Tools
fr: Outils

source: Show Log Window
fr: Afficher la fenêtre du journal des évènements

source: Log level
fr: Niveau de journal

source: Only errors
fr: Erreurs seulement

source: Errors and warnings
fr: Erreurs et avertissements

source: Verbose
fr: Verbeux

source: Log
fr: Journal

source: About
fr: À propos

source: Help
fr: Aide

source: Load / create a workspace
fr: Charger / créer un espace de travail

source: Load an existing file
fr: Charger un fichier existant

source: Load workspace
fr: Charger un espace de travail

source: or continue to create a new workspace
fr: ou continuer à créer un nouvel espace de travail

source: Path to save the new file
fr: Chemin pour enregistrer le nouveau fichier

source: Select a file
fr: Séléctionner un fichier

source: Workspace options
fr: Options de l'espace de travail

source: Path to the forecasts directory
fr: Chemin d'accès au répertoire des prévisions

source: Select a folder
fr: Sélectionner un dossier

source: Other workspace parameters can be defined in the preferences frame.
fr: D'autres paramètres de l'espace de travail peuvent être définis dans la fenêtre des préférences.

source: Base map
fr: Carte de base

source: Choose the base map for your project
fr: Choisissez la carte de base pour votre projet

source: Custom layers
fr: Couches personnalisées

source: Terrain from Google maps (recommended)
fr: Terrain de Google maps (recommandé)

source: Map from Google maps
fr: Carte de Google maps

source: Map from Openstreetmap
fr: Carte de OpenStreetMap

source: Map from ArcGIS Mapserver
fr: Carte d'ArcGIS Mapserver

source: Satellite imagery from Google maps
fr: Images satellites de Google maps

source: Satellite imagery from VirtualEarth
fr: Images satellites de VirtualEarth

source: Other GIS layers can be added in the viewer frame directly, and be saved to the workspace.
fr: D'autres couches SIG peuvent être ajoutées directement dans la fenêtre du Viewer et être enregistrées dans l'espace de travail.

source: Station name
fr: Nom de la station

source: Export as txt
fr: Exporter en txt

source: Preview
fr: Aperçu

source: Print
fr: Imprimer

source: Reset zoom
fr: Réinitialiser le zoom

source: Select forecast
fr: Sélectionner une prévision

source: Select station
fr: Sélectionner une station

source: Select date
fr: Sélectionner une date

source: Predictands distribution
fr: Distribution des prédictants

source: Forecast
fr: Prévision

source: Lead time
fr: Échéance

source: Method
fr: Méthode

source: Possible predictors
fr: Prédicteurs possibles

source: Layers of the left panel
fr: Couches du panneau de gauche

source: Layers of the right panel
fr: Couches du panneau de droite

source: Analogs
fr: Analogues

source: Open GIS layer
fr: Ouvrir couche SIG

source: Directory containing the forecasts
fr: Répertoire contenant les prévisions

source: Set the maximum rainfall value for the colorbar
fr: Définir la valeur maximale de la pluviométrie pour la barre de couleur

source: Number of past days to display on the timeseries
fr: Nombre de jours passés à afficher dans la série temporelle

source: Alarms panel
fr: Panneau des alarmes

source: Return period to display
fr: Période de retour à afficher

source: years
fr: années

source: Quantile to display
fr: Quantile à afficher

source: (in between 0 - 1)
fr: (entre 0 et 1)

source: Maximum length of time series to display
fr: Longueur maximale de la série temporelle à afficher

source: Requires a restart or opening new forecasts.
fr: Nécessite un redémarrage ou l'ouverture de nouvelles prévisions.

source: Daily forecasts
fr: Prévisions journalières

source: days
fr: jours

source: Sub-daily forecasts
fr: Prévisions infra-journalières

source: hours
fr: heures

source: Workspace
fr: Espace de travail (workspace)

source: Path to the predictor datasets
fr: Chemin d'accès aux jeux de données prédicteurs

source: Path to the directory
fr: Chemin d'accès au répertoire

source: Paths
fr: Chemins

source: Paths to the color tables
fr: Chemins d'accès aux palettes de couleurs

source: Geopotential height
fr: Hauteur géopotentielle

source: Precipitable water
fr: Eau précipitable

source: Relative humidity
fr: Humidité relative

source: Specific humidity
fr: Humidité spécifique

source: Colors
fr: Couleurs

source: Language
fr: Langue

source: English
fr: Anglais

source: French
fr: Français

source: Restart AtmoSwing for the change to take effect.
fr: Redémarrez AtmoSwing pour que la modification prenne effet.

source: Logs
fr: Journaux

source: Errors only (recommanded)
fr: Erreurs uniquement (recommandé)

source: Display window
fr: Afficher fenêtre

source: Save to a file
fr: Enregistrer dans un fichier

source: Proxy configuration
fr: Configuration du proxy

source: Internet connection uses a proxy
fr: La connexion Internet utilise un proxy

source: Proxy address
fr: Adresse du proxy

source: Username
fr: Nom d'utilisateur

source: Password
fr: Mot de passe

source: General
fr: Général

source: Allow multiple instances of the viewer
fr: Autoriser plusieurs instances du Viewer

source: User specific paths
fr: Chemins d'accès spécifiques à l'utilisateur

source: User working directory:
fr: Répertoire de travail de l'utilisateur :

source: Log file:
fr: Fichier journal :

source: Preferences file:
fr: Fichier de préférences :

source: Advanced
fr: Avancé

source: Creation of memory dataset failed.
fr: La création d'un jeu de données en mémoire a échoué.

source: Setting projection to predictor layer failed.
fr: La définition de la projection de la couche prédicteur a échoué.

source: Setting geotransform to predictor layer failed.
fr: Le réglage de la géotransformation de la couche prédicteur a échoué.

source: Setting data to predictor layer failed.
fr: L'attribution des données dans la couche prédicteur a échoué.

source: The x block size does not match the data.
fr: La taille du bloc x ne correspond pas aux données.

source: The y block size should be 1.
fr: La taille du bloc y doit être de 1.

source: Image creation failed, out of memory
fr: Échec de la création d'image, manque de mémoire

source: Error getting raster predictor data.
fr: Erreur dans l'obtention des données raster du prédicteur.

source: Error creating feature
fr: Erreur lors de la création des features

source: Drawing of the symbol failed.
fr: Le dessin du symbole a échoué.

source: The color table format %s is not supported.
fr: Le format de palette de couleurs %s n'est pas pris en charge.

source: Color table file %s could not be opened...
fr: Le fichier de palette des couleurs %s n'a pas pu être ouvert...

source: Color table format not supported (file %s)...
fr: Le format de la palette des couleurs n'est pas pris en charge (fichier %s)...
