Repository: atmoswing/atmoswing
Catalog: locales/*/app_optimizer_core.po
Languages: fr

source: The file %s is not a parameters file for the Optimizer in calibration mode.
fr: Le fichier %s n'est pas un fichier de paramètres pour l'Optimizer en mode calibration.

source: The file %s is not a parameters file for the Optimizer.
fr: Le fichier %s n'est pas un fichier de paramètres pour l'Optimizer.

source: The whole processing took %.3f min to execute
fr: L'ensemble du traitement a duré %.3f min

source: Calibration over.
fr: Le calage est terminé.

source: The parameters could not be calibrated
fr: Les paramètres n'ont pas pu être calibrés

source: The score order is not correctly defined.
fr: L'ordre des scores n'est pas correctement défini.

source: An unexpected error occurred.
fr: Une erreur inattendue s’est produite.

source: You cannot use predictand thresholds with the multivariate approach.
fr: Il n'est pas possible d'utiliser des seuils de prédictands avec l'approche multivariée.

source: The time array mode for the target dates is not correctly defined.
fr: Le mode de tableau des dates pour les dates cibles n'est pas correctement défini.

source: Failed loading predictor data.
fr: Échec du chargement des données prédicteurs.

source: The time array is not consistent in asMethodCalibrator::GetAnalogsDates: size=%d.
fr: Le tableau des dates n'est pas cohérent dans asMethodCalibrator::GetAnalogsDates : size=%d.

source: Date arrays created.
fr: Tableaux des dates créés.

source: Start processing the comparison.
fr: Début du calcul de la comparaison.

source: Failed processing the analogs dates.
fr: Échec du calcul des dates analogues.

source: The processing is over.
fr: Le calcul est terminé.

source: Creating a date arrays for the processor.
fr: Création d'un tableau de dates pour le processeur.

source: Creating a criterion object.
fr: Création d'un objet critère.

source: Criterion object created.
fr: Objet de critère créé.

source: Start setting the predictand values to the corresponding analog dates.
fr: Début de l'attribution des valeurs de prédictand aux les dates analogues correspondantes.

source: Failed setting the predictand values to the corresponding analog dates.
fr: Échec de l'attribution des valeurs de prédictand aux les dates analogues correspondantes.

source: Predictand association over.
fr: L'association des prédicteurs est terminée.

source: Instantiating a score object
fr: Instanciation d'un objet score

source: Processing the score of the climatology.
fr: Calcul du score de la climatologie.

source: Start processing the score.
fr: Début du calcul du score.

source: Failed processing the score.
fr: Échec du calcul du score.

source: Creating a date array for the final score.
fr: Création d'un tableau de dates pour le score final.

source: Date array created.
fr: Tableau de dates créé.

source: Start processing the final score.
fr: Début du calcul du score final.

source: Failed to process the final score.
fr: Échec du calcul du score final.

source: Processing over.
fr: Le calcul est terminé.

source: Error assessing the number of analogues.
fr: Erreur d'évaluation du nombre d'analogues.

source: The dates selection contains NaNs
fr: La sélection des dates contient des NaNs

source: The parameters have no validation period !
fr: Les paramètres n'ont pas de période de validation !

source: You need to preload the data for the classic calibration.
fr: Vous devez précharger les données pour la calibration classique.

source: Calibrating station %s.
fr: Calage de la station %s.

source: Creating the complete relevance map for a given predictor.
fr: Création de la carte de pertinence complète pour un prédicteur donné.

source: Best point on relevance map: %.2f lat, %.2f lon
fr: Meilleur point sur la carte de pertinence : %.2f lat, %.2f lon

source: Find the analogs number for every step.
fr: Identification du nombre d'analogues pour chaque étape.

source: Preloading data (if required).
fr: Préchargement des données (si nécessaire).

source: Could not preload the data.
fr: Impossible de précharger les données.

source: Bad allocation caught during data preloading: %s
fr: Mauvaise allocation détectée lors du préchargement des données : %s

source: Exception caught during data preloading: %s
fr: Exception levée lors du préchargement des données : %s

source: Data preloading is over.
fr: Le préchargement des données est terminé.

source: Process sub-level %d
fr: Calcul du sous-niveau %d

source: Time to process the relevance map: %.3f min.
fr: Temps de calcul de la carte de pertinence : %.3f min.

source: Resize the spatial domain for every predictor.
fr: Redimensionnement du domaine spatial pour chaque prédicteur.

source: Resizing not correctly defined.
fr: Le redimensionnement n'est pas correctement défini.

source: Time to process the first resizing procedure: %.3f min.
fr: Temps de traitement de la première procédure de redimensionnement : %.3f min.

source: Reshape again (calibration plus) the spatial domain for every predictor.
fr: Changer à nouveau (calibration plus) le domaine spatial pour chaque prédicteur.

source: Improved spatial window size and position (move %d, factor %d)
fr: Amélioration de la taille et de la position de la fenêtre spatiale (déplacement %d, facteur %d)

source: Time to process the second resizing procedure: %.3f min
fr: Durée de la deuxième procédure de redimensionnement : %.3f min

source: The final dates selection contains NaNs
fr: La sélection finale des dates contient des NaN

source: Area: yMin = %.2f, yPtsNb = %d, xMin = %.2f, xPtsNb = %d
fr: Zone : yMin = %.2f, yPtsNb = %d, xMin = %.2f, xPtsNb = %d

source: Processing variables exploration for step %d
fr: Traitement de l'exploration des variables pour l'étape %d

source: Processing %d variables, %d hours, %d levels, %d criteria.
fr: Traitement de %d variables, %d heures, %d niveaux, %d critères.

source: The given step number for variables exploration is above available steps.
fr: Le numéro d'étape donné pour l'exploration des variables est supérieur aux étapes disponibles.

source: Calibration method not implemented to work with preprocessed data.
fr: La méthode de calage n'est pas implémentée de manière à travailler avec des données prétraitées.

source: The following parameters are not compatible with the EvaluateAllScores assessment:
fr: Les paramètres suivants ne sont pas compatibles avec l'évaluation EvaluateAllScores :

source: Processing station %s
fr: Calcul de la station %s

source: Processing %s
fr: Traitement %s

source: Processing the Verification Rank Histogram
fr: Calcul du 'Verification Rank Histogram'

source: The following parameters are not compatible with the single assessment:
fr: Les paramètres suivants ne sont pas compatibles avec l'évaluation unique :

source: Do not process a score. Use to save intermediate values.
fr: Ne pas calculer un score. Utiliser pour sauvegarder les valeurs intermédiaires.

source: Bad allocation caught in GAs: %s
fr: Mauvaise allocation détectée dans les AGs : %s

source: Exception caught in the GAs: %s
fr: Exception détectée dans les GA : %s

source: %d GPUs provided, but only %d found.
fr: %d GPUs fournis, mais seulement %d trouvés.

source: station_%s_best_individual
fr: station_%s_final_population

source: Optimization has already converged.
fr: L'optimisation a déjà convergé.

source: Predictor data preloaded.
fr: Données du prédicteur préchargées.

source: Bad allocation caught during data preloading (in GAs): %s
fr: Mauvaise allocation détectée lors du préchargement des données (GAs) : %s

source: Exception caught during data preloading (in GAs): %s
fr: Exception rencontrée lors du préchargement des données (dans les GAs) : %s

source: Failed to resume previous runs
fr: Échec de la reprise des résultats précédents

source: Could not create the operators file.
fr: Impossible de créer le fichier des opérateurs.

source: Loading the Predictand DB.
fr: Chargement de la base de données des prédictands.

source: Predictand DB loaded.
fr: BD des prédictands chargé.

source: NaN found in the scores (element %d on %d in m_scoresCalib).
fr: NaN trouvé dans les scores (élément %d sur %d dans m_scoresCalib).

source: Parameters #%d: %s
fr: Paramètres #%d : %s

source: Mean %g, best %g
fr: Moyenne %g, meilleur %g

source: Epoch number %d
fr: Numéro d'époque %d

source: Optimization process over.
fr: Le processus d'optimisation est terminé.

source: The parameters could not be optimized
fr: Les paramètres n'ont pas pu être optimisés

source: Optimization over.
fr: Optimisation terminée.

source: The file containing the final population could not be generated.
fr: Le fichier contenant la population finale n'a pas pu être généré.

source: The file containing the best individual could not be generated.
fr: Le fichier contenant le meilleur individu n'a pas pu être généré.

source: The output xml parameters file could not be generated.
fr: Le fichier de paramètres xml de sortie n'a pas pu être généré.

source: The directory %s could not be opened.
fr: Le répertoire %s n'a pas pu être ouvert.

source: The directory %s already contains the resulting file.
fr: Le répertoire %s contient déjà le fichier résultat.

source: The number of former results is not consistent with the population size (%d).
fr: Le nombre d'anciens résultats n'est pas cohérent avec la taille de la population (%d).

source: Previous intermediate results were found and will be loaded (%d lines).
fr: Les résultats intermédiaires précédents ont été trouvés et seront chargés (%d lignes).

source: Couldn't open the file %s.
fr: Impossible d'ouvrir le fichier %s.

source: The number of steps do not correspond between the current and the previous parameters.
fr: Le nombre d'étapes ne correspond pas entre les paramètres actuels et les paramètres précédents.

source: The number of predictors do not correspond between the current and the previous parameters.
fr: Le nombre de prédicteurs ne correspond pas entre les paramètres actuels et les paramètres précédents.

source: The number of atmospheric levels do not correspond between the current and the previous parameters.
fr: Le nombre de niveaux atmosphériques ne correspond pas entre les paramètres actuels et les paramètres précédents.

source: %d former results have been reloaded.
fr: %d anciens résultats ont été rechargés.

source: %d former results have been reloaded.
fr: %d anciens résultats ont été rechargés.

source: %d generation bests have been reloaded.
fr: %d meilleurs individus ont été rechargés.

source: %d generation bests have been reloaded.
fr: %d meilleurs individus ont été rechargés.

source: No log file found to restore the number of epochs (directory: %s)
fr: Aucun fichier journal n'a été trouvé pour restaurer le nombre d'époques (répertoire : %s)

source: Starting again from epoch %d.
fr: Recommencer à partir de l'époque %d.

source: Previous operators were found and will be loaded.
fr: Des opérateurs précédents ont été trouvés et seront chargés.

source: Previous operators were found and will be loaded.
fr: Des opérateurs précédents ont été trouvés et seront chargés.

source: Mismatch between number of parameters (%d) and operators (%d).
fr: Inadéquation entre le nombre de paramètres (%d) et les opérateurs (%d).

source: The mutation method was not found when saving operators.
fr: La méthode de mutation n'a pas été trouvée lors de l'enregistrement des opérateurs.

source: The population is made of %d individuals.
fr: La population est composée de %d individus.

source: Generation number %d
fr: Numéro de génération %d

source: Application of elitism after mutation.
fr: Application de l'élitisme après mutation.

source: Score order not correctly defined.
fr: L'ordre des scores n'est pas correctement défini.

source: Application of elitism in the natural selection.
fr: Application de l'élitisme dans la sélection naturelle.

source: Applying natural selection.
fr: Application de la sélection naturelle.

source: Natural selection: ratio elitism
fr: Sélection naturelle : élitisme par ratios

source: Natural selection: tournament
fr: Sélection naturelle : tournoi

source: The given natural selection method couldn't be found.
fr: La méthode de sélection naturelle donnée n'a pas pu être trouvée.

source: Applying mating.
fr: Application de l'accouplement.

source: Selecting couples.
fr: Sélection des couples.

source: Couples selection: rank pairing
fr: Sélection des couples : appariement des rangs

source: Couples selection: random
fr: Sélection des couples : au hasard

source: Couples selection: roulette wheel rank
fr: Sélection des couples : roulette sur la base des rangs

source: Couples selection: roulette wheel score
fr: Sélection des couples : roulette sur la base des scores

source: The sum of the probabilities is null.
fr: La somme des probabilités est nulle.

source: Could not find a value in the probability distribution.
fr: Impossible de trouver une valeur dans la distribution de probabilité.

source: Couples selection: tournament
fr: Sélection des couples : tournoi

source: The number of individuals for tournament selection is inferior to 2.
fr: Le nombre d'individus pour la sélection du tournoi est inférieur à 2.

source: The number of individuals for tournament selection has been changed.
fr: Le nombre d'individus pour la sélection du tournoi a été modifié.

source: The number of individuals for tournament selection superior to the half of the intermediate population.
fr: Le nombre d'individus pour la sélection du tournoi est supérieur à la moitié de la population intermédiaire.

source: The desired couples selection method is not yet implemented.
fr: La méthode de sélection des couples souhaitée n'est pas encore implémentée.

source: The same two partners were chosen more than 100 times. Lost in a loop.
fr: Les deux mêmes partenaires ont été choisis plus de 100 fois. Perdu dans une boucle.

source: Crossing chromosomes.
fr: Croisement de chromosomes.

source: Crossing: single point crossover
fr: Croisement : croisement à point unique

source: Crossing: double points crossover
fr: Croisement : croisement à double point

source: Crossing point already selected. Selection of a new one.
fr: Point de croisement déjà sélectionné. Sélection d'un nouveau point de croisement.

source: There are more crossing points than chromosomes.
fr: Il y a plus de points de croisement que de chromosomes.

source: Crossing: multiple points crossover
fr: Croisement : croisement à plusieurs points

source: The desired crossings number is superior or equal to the genes number.
fr: Le nombre de croisements souhaité est supérieur ou égal au nombre de gènes.

source: Crossing: uniform crossover
fr: Croisement : croisement uniforme

source: Crossing: limited blending
fr: Croisement : mélange limité

source: Crossing: linear crossover
fr: Croisement : croisement linéaire

source: Crossing: heuristic crossover
fr: Croisement : croisement heuristique

source: Crossing: binary-like crossover
fr: Croisement : croisement de type binaire

source: Crossing: linear interpolation
fr: Croisement : interpolation linéaire

source: Crossing: free interpolation
fr: Croisement : interpolation libre

source: The desired chromosomes crossing is not yet implemented.
fr: Le croisement des chromosomes souhaité n'est pas encore implémenté.

source: Applying mutations.
fr: Application des mutations.

source: The desired mutation method is not yet implemented.
fr: La méthode de mutation souhaitée n'est pas encore implémentée.

source: Random method over.
fr: Méthode aléatoire terminée.

source: Loading parameters file.
fr: Chargement du fichier de paramètres.

source: The given path to the parameters file is empty.
fr: Le chemin d'accès au fichier de paramètres est vide.

source: Parameters file loaded.
fr: Fichier de paramètres chargé.

source: The preload option has been disabled. This can result in very long computation time.
fr: L'option de préchargement a été désactivée. Cela peut entraîner des temps de calcul très longs.

source: The postptocessing is not yet fully implemented.
fr: Le postptocessing n'est pas encore entièrement mis en œuvre.

source: The %s preprocessing method is not yet handled with the preload option.
fr: La méthode de prétraitement %s n'est pas encore gérée par l'option preload.

source: The beginning of the archive period was not provided in the parameters file.
fr: Le début de la période d'archive n'a pas été indiqué dans le fichier de paramètres.

source: The end of the archive period was not provided in the parameters file.
fr: La fin de la période d'archive n'a pas été indiquée dans le fichier de paramètres.

source: The beginning of the calibration period was not provided in the parameters file.
fr: Le début de la période de calage n'a pas été indiqué dans le fichier de paramètres.

source: The end of the calibration period was not provided in the parameters file.
fr: La fin de la période de calage n'a pas été indiquée dans le fichier des paramètres.

source: The validation period was not provided in the parameters file (it can be on purpose).
fr: La période de validation n'a pas été indiquée dans le fichier des paramètres (cela peut être volontaire).

source: The time step was not provided in the parameters file.
fr: Le pas de temps n'a pas été fourni dans le fichier de paramètres.

source: The predictand time series (for the threshold preselection) was not provided in the parameters file.
fr: La série temporelle du prédictand (pour la présélection du seuil) n'a pas été fournie dans le fichier de paramètres.

source: The provided min/max predictand thresholds are equal in the parameters file.
fr: Les seuils min/max des prédictands fournis sont égaux dans le fichier des paramètres.

source: The interval days for the analogs preselection was not provided in the parameters file.
fr: L'intervalle de jours pour la présélection des analogues n'a pas été fourni dans le fichier de paramètres.

source: The number of days to exclude around the target date was not provided in the parameters file.
fr: Le nombre de jours à exclure autour de la date cible n'est pas fourni dans le fichier de paramètres.

source: The number of analogs (step %d) was not provided in the parameters file.
fr: Le nombre d'analogues (étape %d) n'a pas été fourni dans le fichier de paramètres.

source: The preprocessing method (step %d, predictor %d) was not provided in the parameters file.
fr: La méthode de prétraitement (étape %d, prédicteur %d) n'a pas été fournie dans le fichier de paramètres.

source: The dataset for preprocessing (step %d, predictor %d) was not provided in the parameters file.
fr: Le jeu de données pour le prétraitement (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: The data for preprocessing (step %d, predictor %d) was not provided in the parameters file.
fr: Les données pour le prétraitement (étape %d, prédicteur %d) n'ont pas été fournies dans le fichier de paramètres.

source: The level for preprocessing (step %d, predictor %d) was not provided in the parameters file.
fr: Le niveau de prétraitement (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: The time for preprocessing (step %d, predictor %d) was not provided in the parameters file.
fr: L'heure du prétraitement (étape %d, prédicteur %d) n'a pas été indiquée dans le fichier de paramètres.

source: The dataset (step %d, predictor %d) was not provided in the parameters file.
fr: Le jeu de données (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: The data (step %d, predictor %d) was not provided in the parameters file.
fr: Les données (étape %d, prédicteur %d) n'ont pas été fournies dans le fichier de paramètres.

source: The level (step %d, predictor %d) was not provided in the parameters file.
fr: Le niveau (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: The time (step %d, predictor %d) was not provided in the parameters file.
fr: L'heure (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: The grid type (step %d, predictor %d) is empty in the parameters file.
fr: Le type de grille (étape %d, prédicteur %d) est vide dans le fichier de paramètres.

source: The X min value (step %d, predictor %d) was not provided in the parameters file.
fr: La valeur X min (étape %d, prédicteur %d) n'a pas été fournie dans le fichier de paramètres.

source: The X points nb value (step %d, predictor %d) was not provided in the parameters file.
fr: La valeur nb des points en X (étape %d, prédicteur %d) n'a pas été fournie dans le fichier de paramètres.

source: The Y min value (step %d, predictor %d) was not provided in the parameters file.
fr: La valeur Y min (étape %d, prédicteur %d) n'a pas été fournie dans le fichier de paramètres.

source: The Y points nb value (step %d, predictor %d) was not provided in the parameters file.
fr: La valeur nb des points en Y (étape %d, prédicteur %d) n'a pas été fournie dans le fichier de paramètres.

source: The criteria (step %d, predictor %d) was not provided in the parameters file.
fr: Le critère (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: The station ID was not provided in the parameters file (it can be on purpose).
fr: L'identifiant de la station n'a pas été fourni dans le fichier de paramètres (cela peut être volontaire).

source: The score was not provided in the parameters file.
fr: Le score n'a pas été fourni dans le fichier des paramètres.

source: The total score was not provided in the parameters file.
fr: Le score total n'a pas été fourni dans le fichier des paramètres.

source: The provided predictand ID vector is empty.
fr: Le vecteur d'identification du prédictand fourni est vide.

source: There are 0s in the provided predictand ID vector.
fr: Le vecteur d'identification du prédictand fourni contient des valeurs nulles.

source: There are NaN values in the provided scores vector.
fr: Le vecteur de scores fourni contient des valeurs NaN.

source: The rank histogram can only be processed in the 'all scores' evaluation method.
fr: L'histogramme des rangs ne peut être traité que dans la méthode d'évaluation 'all scores'.

source: Trying to access to an element outside of preprocessHours (lower limit) in the parameters object.
fr: Tentative d'accès à un élément en dehors de preprocessHours (limite inférieure) dans l'objet des paramètres.

source: Trying to access to an element outside of preprocessHours (upper limit) in the parameters object.
fr: Tentative d'accès à un élément en dehors de preprocessHours (limite supérieure) dans l'objet des paramètres.

source: The %s preprocessing method is not handled in the optimizer.
fr: La méthode de prétraitement %s n'est pas prise en compte par l'optimiseur.

source: asParametersOptimization::CheckRange is not ready to use on unregular grids (PredictorGridType = %s)
fr: asParametersOptimization::CheckRange n'est pas prêt à être utilisé sur des grilles non régulières (PredictorGridType = %s)

source: The sum of the locked weights of the analogy level number %d is higher than 1 (%f). They were forced as unlocked.
fr: La somme des poids verrouillés du niveau d'analogie numéro %d est supérieure à 1 (%f). Ils ont été forcés à être déverrouillés.

source: We should never reach that point...
fr: Nous ne devrions jamais en arriver là...

source: Generating parameters file.
fr: Génération d'un fichier de paramètres.

source: Parameters file generated.
fr: Fichier de paramètres généré.

source: The preprocess dataId must be unique with the preload option.
fr: L'identifiant de données de prétraitement doit être unique avec l'option preload.

source: The current score (%s) doesn't correspond to the previous one (%s).
fr: Le score actuel (%s) ne correspond pas au score précédent (%s).
