Repository: atmoswing/atmoswing
Catalog: locales/*/app_optimizer_core.po
Languages: fr

source: Error: The current score (%s) doesn't correspond to the previous one (%s).
fr: Erreur : Le score actuel (%s) ne correspond pas au score précédent (%s).

source: The given analogs number for the score (%d) processing is superior to the analogs dates number (%d).
fr: Le nombre d'analogues donné pour le traitement du score (%d) est supérieur au nombre de dates analogues (%d).

source: The processing of multivariate complex scores is not implemented yet.
fr: Le traitement des scores complexes multivariés n'est pas encore implémenté.

source: Optimization processed %s
fr: Optimisation traitée %s

source: Saving intermediate file: %s
fr: Enregistrement du fichier intermédiaire : %s

source: asResultsScoresMap::Add is not ready to use on unregular grids
fr: asResultsScoresMap::Add n'est pas prêt à être utilisé sur des grilles non régulières

source: The score was not correctly set (undefined).
fr: Le score n'a pas été correctement défini (indéfini).

source: The score was not correctly set (cannot use %s).
fr: Le score n'a pas été correctement défini (on ne peut pas utiliser %s).

source: This asScore class has no AssessOnArrays method implemented !
fr: Cette classe asScore n'a pas de méthode AssessOnArrays implémentée !

source: The observed value is a NaN for the score calculation.
fr: La valeur observée est un NaN pour le calcul du score.

source: The required elements number is above the vector length in the score calculation.
fr: Le nombre d'éléments requis est supérieur à la longueur du vecteur dans le calcul du score.

source: Not enough data to perform the score calculation.
fr: Pas assez de données pour effectuer le calcul du score.

source: Problems in a vector length.
fr: Problèmes liés à la longueur d'un vecteur.

source: Only NaNs as inputs in the Brier score processing function.
fr: Uniquement des NaNs en entrée de la fonction de traitement du score de Brier.

source: Not enough elements to process the Brier score.
fr: Pas assez d'éléments pour traiter le score de Brier.

source: Error processing BS score.
fr: Erreur de traitement du score BS.

source: BS Skill Score
fr: Score de compétence BS

source: Score of the climatology: %g.
fr: Score de la climatologie : %g.

source: Contingency table
fr: Tableau de contingence

source: Only NaNs as inputs in the Contingency table processing function.
fr: Uniquement des NaNs comme entrées dans la fonction de traitement des tableaux de contingence.

source: Not enough elements to process the Contingency table.
fr: Il n'y a pas assez d'éléments pour traiter le tableau des contingences.

source: Continuous Ranked Probability Score Accuracy approximation with the rectangle method
fr: Continuous Ranked Probability Score Accuracy avec la méthode des rectangles

source: Continuous Ranked Probability Score Accuracy exact solution
fr: Continuous Ranked Probability Score Accuracy solution exacte

source: Continuous Ranked Probability Score approximation with the rectangle method
fr: Continuous Ranked Probability Score avec la méthode des rectangles

source: Only NaNs as inputs in the CRPS processing function.
fr: Uniquement des NaNs comme entrées dans la fonction du CRPS.

source: Not enough elements to process the CRPS.
fr: Il n'y a pas assez d'éléments pour calculer le CRPS.

source: Continuous Ranked Probability Score exact solution
fr: Continuous Ranked Probability Score solution exacte

source: Only NaNs as inputs in the CRPS processing function
fr: Uniquement des NaNs comme entrées dans la fonction du CRPS

source: CRPS Hersbach decomposition
fr: CRPS Décomposition de Hersbach

source: Hersbach decomposition of the Continuous Ranked Probability Score (Hersbach, 2000)
fr: Décomposition de Hersbach du CRPS (Hersbach, 2000)

source: The Hersbach decomposition of the CRPS cannot provide a single score value !
fr: La décomposition de Hersbach du CRPS ne peut pas fournir une valeur de score unique !

source: NaNs were found in the CRPS Hersbach decomposition processing function. Cannot continue.
fr: Des NaNs ont été trouvés dans la décomposition de Hersbach du CRPS. Impossible de continuer.

source: CRPS Skill Score
fr: Score de compétence du CRPS

source: Continuous Ranked Probability Score Skill Score based on the approximation with the rectangle method
fr: CRPSS basé sur l'approximation avec la méthode des rectangles

source: Continuous Ranked Probability Score Sharpness exact solution
fr: Continuous Ranked Probability Score Sharpness solution exacte

source: Difference of F(0)
fr: Différence de F(0)

source: Absolute difference of the frequency of null precipitations.
fr: Différence absolue de la fréquence des précipitations nulles.

source: Only NaNs as inputs in the DF0 processing function.
fr: Uniquement des NaNs comme entrées dans la fonction du DF0.

source: Not enough elements to process the DF0.
fr: Pas assez d'éléments pour traiter le DF0.

source: Error processing DF0 score.
fr: Erreur de traitement du score DF0.

source: Mean absolute error
fr: Erreur absolue moyenne

source: Not enough elements to process the MAE.
fr: Il n'y a pas assez d'éléments pour calculer le MAE.

source: Mean square error
fr: Erreur quadratique moyenne

source: Only NaNs as inputs in the MSE processing function.
fr: Uniquement des NaNs comme entrées dans la fonction du MSE.

source: Not enough elements to process the MSE.
fr: Pas assez d'éléments pour calculer le MSE.

source: Rank Histogram
fr: Histogramme des rangs

source: Verification Rank Histogram (Talagrand Diagram)
fr: Verification Rank Histogram (diagramme de Talagrand)

source: NaNs were found in the Rank Histogram processing function. Cannot continue.
fr: Des NaN ont été trouvés dans la fonction de l'histogramme des rangs. Impossible de continuer.

source: Stable equitable error in probability space
fr: Erreur équitable stable dans l'espace de probabilité

source: Not enough elements to process SEEPS.
fr: Pas assez d'éléments pour calculer SEEPS.

source: Error processing the SEEPS climatology score.
fr: Erreur dans le traitement du score climatologique de SEEPS.

source: Failed processing the analogs dates
fr: Échec du traitement des dates analogues

source: Failed processing the analogs sub dates
fr: Échec du traitement des sous-échantillon des analogues

source: The asResultsDates object is empty in asThreadGAs.
fr: L'objet asResultsDates est vide dans asThreadGAs.

source: Failed processing the analogs values
fr: Échec du traitement des valeurs analogues

source: Failed processing the scores
fr: Échec du traitement des scores

source: Failed processing the total score
fr: Échec du traitement du score total

source: Process score of the climatology
fr: Calcul du score de la climatologie

source: The total score period was not correctly set.
fr: La période pour le score total n'a pas été correctement définie.

source: The total score was not correctly set.
fr: Le score total n'a pas été correctement défini.

source: This asTotalScore class has no AssessOnArray method implemented !
fr: Cette classe asTotalScore n'a pas de méthode AssessOnArray implémentée !

source: This asTotalScore class has no Assess method implemented with a 2D array as argument !
fr: Cette classe asTotalScore n'a pas de méthode Assess implémentée avec un tableau 2D comme argument !

source: The B score (%f) is not an authorized value.
fr: Le score B (%f) n'est pas une valeur autorisée.

source: Period not yet implemented in asTotalScoreB.
fr: Période non implémentée dans asTotalScoreB.

source: The F score (%f) is not an authorized value.
fr: Le score F (%f) n'est pas une valeur autorisée.

source: Period not yet implemented in asTotalScoreF.
fr: Période non implémentée dans asTotalScoreF.

source: The FAR score (%f) is not an authorized value.
fr: Le score FAR (%f) n'est pas une valeur autorisée.

source: Period not yet implemented in asTotalScoreFAR.
fr: Période non implémentée dans asTotalScoreFAR.

source: The GSS score (%f) is not an authorized value.
fr: Le score GSS (%f) n'est pas une valeur autorisée.

source: Period not yet implemented in asTotalScoreGSS.
fr: Période non implémentée dans asTotalScoreGSS.

source: The H score (%f) is not an authorized value.
fr: Le score H (%f) n'est pas une valeur autorisée.

source: Period not yet implemented in asTotalScoreH.
fr: Période non implémentée dans asTotalScoreH.

source: The HSS score (%f) is not an authorized value.
fr: Le score HSS (%f) n'est pas une valeur autorisée.

source: Period not yet implemented in asTotalScoreHSS.
fr: Période non implémentée dans asTotalScoreHSS.

source: Error processing the final mean score.
fr: Traitement de l'erreur sur le score moyen finale.

source: Period not yet implemented in asTotalScoreMean.
fr: Période non implémentée dans asTotalScoreMean.

source: You cannot process a score using the climatology on a binned period.
fr: Il n'est pas possible de calculer un score en utilisant la climatologie sur une période binnée.

source: Period not yet implemented in asTotalScoreMeanWithClim.
fr: Période non implémentée dans asTotalScoreMeanWithClim.

source: Error processing the final MSE score.
fr: Traitement de l'erreur dans le score final de l'EQM.

source: Period not yet implemented in asTotalScoreMSE.
fr: Période non implémentée dans asTotalScoreMSE.

source: The PC score (%f) is not an authorized value.
fr: Le score PC (%f) n'est pas une valeur autorisée.

source: Period not yet implemented in asTotalScorePC.
fr: Période non implémentée dans asTotalScorePC.

source: The PSS score (%f) is not an authorized value.
fr: Le score PSS (%f) n'est pas une valeur autorisée.

source: Period not yet implemented in asTotalScorePSS.
fr: Période non implémentée dans asTotalScorePSS.

source: The rank histogram cannot provide a single score value !
fr: L'histogramme des rangs ne peut pas fournir une seule valeur de score !

source: Period not yet implemented in asTotalScoreRankHistogram.
fr: Période non implémentée dans asTotalScoreRankHistogram.

source: Error processing the final rank histogram.
fr: Erreur dans le traitement de l'histogramme de rang final.

source: Calling asTotalScoreRankHistogramReliability::Assess means it doesn't do bootstraping.
fr: L'appel de asTotalScoreRankHistogramReliability::Assess signifie qu'il n'y a pas de bootstrap.

source: Period not yet implemented in asTotalScoreRankHistogramReliability.
fr: Période non implémentée dans asTotalScoreRankHistogramReliability.

source: The TS score (%f) is not an authorized value.
fr: Le score TS (%f) n'est pas une valeur autorisée.

source: Period not yet implemented in asTotalScoreTS.
fr: Période non implémentée dans asTotalScoreTS.

source: Program already running, aborting.
fr: Programme déjà en cours d'exécution, interruption.

source: An existing directory was found for the run number %d
fr: Un répertoire existant a été trouvé pour le numéro de run %d

source: The number of groups (%d) differ from the previous config file (%d).
fr: Le nombre de groupes (%d) diffère du fichier de configuration précédent (%d).

source: The option %s (under Optimizer/%s) differ from the previous config file (%s != %s).
fr: L'option %s (sous Optimizer/%s) diffère du fichier de configuration précédent (%s !=%s).

source: The value provided for 'log-level' could not be interpreted.
fr: La valeur fournie pour "log-level" n'a pas pu être interprétée.

source: The given calibration file (%s) couldn't be found.
fr: Le fichier de calage donné (%s) n'a pas été trouvé.

source: The given predictand DB (%s) couldn't be found.
fr: La base de données des prédictands (%s) n'a pas été trouvée.

source: The given predictors directory (%s) couldn't be found.
fr: Le répertoire des prédicteurs donné (%s) n'a pas pu être trouvé.

source: The value provided for 'ga-config' could not be interpreted.
fr: La valeur fournie pour 'ga-config' n'a pas pu être interprétée.

source: The value provided for 'ga-config' does not match any option.
fr: La valeur fournie pour 'ga-config' ne correspond à aucune option.

source: Initialization for command-line interface failed.
fr: L'initialisation de l'interface de ligne de commande a échoué.

source: Given calibration method: %s
fr: Méthode de calage donnée : %s

source: The parameters file is not given.
fr: Le fichier de paramètres n'est pas fourni.

source: The predictand DB is not given.
fr: La base de données des prédictands n'a pas été fournie.

source: The predictors directory is not given.
fr: Le répertoire des prédicteurs n'est pas fourni.

source: Bad allocation caught: %s
fr: Mauvaise allocation détectée : %s

source: Exception caught: %s
fr: Une exception a été détectée : %s

source: Calibration over.
fr: Le calage est terminé.

source: An exception occured in the main loop
fr: Une exception s'est produite dans la boucle principale

source: An fatal exception occured
fr: Une exception fatale s'est produite

source: An unhandled exception occured
fr: Une exception non gérée s'est produite
