Repository: atmoswing/atmoswing
Catalog: locales/*/app_optimizer_gui.po
Languages: fr

source: Run optimizer
fr: Lancer l'optimisation

source: Run optimizer now
fr: Lancer l'optimisation maintenant

source: Cancel optimization
fr: Annuler l'optimisation

source: Cancel current optimization
fr: Annuler l'optimisation en cours

source: Preferences
fr: Préférences

source: Wrong method selection.
fr: Mauvaise sélection de la méthode.

source: Chosen method not defined yet.
fr: La méthode choisie n'est pas encore définie.

source: Bad allocation caught: %s
fr: Mauvaise allocation détectée : %s

source: Failed to process the calibration.
fr: Échec du calage.

source: Exception caught: %s
fr: Une exception a été détectée : %s

source: Failed to process the optimization.
fr: Le traitement de l'optimisation a échoué.

source: Optimizer over.
fr: L'optimisation est terminée.

source: Welcome to AtmoSwing %s.
fr: Bienvenue dans AtmoSwing %s.

source: AtmoSwing log window
fr: Fenêtre du journal AtmoSwing

source: Select the calibration method
fr: Sélectionner la méthode de calage

source: Single assessment
fr: Évaluation unique

source: Classic calibration
fr: Calibration classique

source: Classic+ calibration
fr: Calibration classique+

source: Variables exploration Classic+
fr: Exploration des variables Classique+

source: Genetic algorithms
fr: Algorithmes génétiques

source: Evaluate all scores
fr: Évaluer touts les scores

source: Only predictand values
fr: Uniquement les valeurs du prédictant

source: Only analog dates (and criteria)
fr: Uniquement les dates analogues (et les critères)

source: Select the parameters file for the calibration
fr: Sélectionner le fichier de paramètres pour le calage

source: Select a file
fr: Séléctionner un fichier

source: Select the predictand DB file
fr: Sélectionner le fichier BD predictand

source: Select the predictors directory
fr: Sélectionner le répertoire des prédicteurs

source: Select a folder
fr: Sélectionner un dossier

source: Directory to save calibration outputs
fr: Répertoire d'enregistrement des résultats du calage

source: Calibration state:
fr: État du calage :

source: Not running.
fr: Pas de calculs en cours.

source: Controls
fr: Contrôles

source: Multiple of the steps in lon for pertinence map
fr: Multiple des pas en longitudes de la carte de pertinence

source: Multiple of the steps in lat for pertinence map
fr: Multiple des pas en latitudes de la carte de pertinence

source: Iterations in final resizing attempts
fr: Itérations dans les tentatives finales de redimensionnement

source: Proceed sequentially (standard)
fr: Procéder de manière séquentielle (standard)

source: Resize the spatial windows separately
fr: Redimensionner les fenêtres spatiales séparément

source: Number of random param. sets
fr: Nombre de jeux de paramètres aléatoires

source: Variables exploration
fr: Exploration des variables

source: Step to explore (0-based)
fr: Étape à explorer (base 0)

source: Calibration
fr: Calage

source: Operators
fr: Opérateurs

source: Natural selection
fr: Sélection naturelle

source: Ratio elitism
fr: Ratio d'élitisme

source: Tournament
fr: Tournois

source: Couples selection
fr: Sélection des couples

source: Rank pairing
fr: Appariement par rangs

source: Randomly
fr: Aléatoirement

source: Roulette wheel on rank
fr: Roulette sur la base des rangs

source: Roulette wheel on score
fr: Roulette sur la base des scores

source: Crossover
fr: Croisement

source: Single point crossover
fr: Croisement à point unique

source: Double points crossover
fr: Croisement à double point

source: Multiple points crossover
fr: Croisement à plusieurs points

source: Uniform crossover
fr: Croisement uniforme

source: Limited blending
fr: Mélange limité

source: Linear crossover
fr: Croisement linéaire

source: Heuristic crossover
fr: Croisement heuristique

source: Binary-like crossover
fr: Croisement de type binaire

source: Linear interpolation
fr: Interpolation linéaire

source: Free interpolation
fr: Interpolation libre

source: Uniform constant
fr: Constante uniforme

source: Uniform variable
fr: Variable uniforme

source: Normal constant
fr: Constante normale

source: Normal variable
fr: Variable normale

source: Non-uniform
fr: Non-uniforme

source: Self adaptation rate
fr: Taux d'auto-adaptation

source: Self adaptation radius
fr: Rayon d'auto-adaptation

source: Self adaptation rate chromosome
fr: Chromosome de taux d'auto-adaptation

source: Self adaptation radius chromosome
fr: Chromosome de rayons d'auto-adaptation

source: Multi scale
fr: Multi-échelle

source: General options
fr: Options générales

source: Runs number
fr: Nombre de runs

source: Population's size
fr: Taille de la population

source: Convergence after
fr: Convergence après

source: Allow elitism for the best
fr: Permettre l'élitisme pour le meilleur

source: Natural slct tournament: prob
fr: Tournoi de slct naturel : prob

source: Couples slct tournament: nb ind.
fr: Tournoi de slct des couples : nb ind.

source: Natural and couple selections
fr: Sélections naturelle et des couples

source: Multiple crossover: nb points
fr: Croisement multiple : nb points

source: Blending crossover: nb points
fr: Croisement par mélange : nb points

source: Blending crossover: share beta
fr: Croisement par mélange : partage de bêta

source: Linear crossover: nb points
fr: Croisement linéaire : nb points

source: Heuristic crossover: nb points
fr: Croisement heuristique : nb points

source: Heuristic crossover: share beta
fr: Croisement heuristique : partage de bêta

source: Binary-like crossover: nb points
fr: Croisement de type binaire : nb points

source: Binary-like crossover: share beta
fr: Croisement de type binaire : partage de bêta

source: Uniform constant: probability
fr: Constante uniforme : probabilité

source: Normal constant: probability
fr: Constante normale : probabilité

source: Normal constant: std dev
fr: Constante normale : écart-type

source: Uniform variable: on # generations
fr: Variable uniforme : sur # générations

source: Uniform variable: starting probability
fr: Variable uniforme : probabilité de départ

source: Uniform variable: ending probability
fr: Variable uniforme : probabilité de fin

source: Multi-scale: probability
fr: Multi-échelle : probabilité

source: Normal variable: prob on # generations
fr: Variable normale : probabilité sur # de générations

source: Normal variable: std dev on # generations
fr: Variable normale : écart-type sur # de générations

source: Normal variable: starting probability
fr: Variable normale : probabilité de départ

source: Normal variable: ending probability
fr: Variable normale : probabilité de fin

source: Normal variable: starting std dev
fr: Variable normale : écart-type de départ

source: Normal variable: ending std dev
fr: Variable normale : écart-type de fin

source: Non-uniform: probability
fr: Non-uniforme : probabilité

source: Non-uniform: on # generations
fr: Non-uniforme : sur # générations

source: Non-uniform: minimum rate
fr: Non-uniforme : taux minimum

source: Genetic algoritms
fr: Algorithmes génétiques

source: Save as default
fr: Enregistrer par défaut

source: Build predictand DB
fr: Construire la base de données des prédictants

source: Tools
fr: Outils

source: Show Log Window
fr: Afficher la fenêtre du journal des évènements

source: Log level
fr: Niveau de journal

source: Only errors
fr: Erreurs seulement

source: Errors and warnings
fr: Erreurs et avertissements

source: Verbose
fr: Verbeux

source: Log
fr: Journal

source: About
fr: À propos

source: Help
fr: Aide

source: Language
fr: Langue

source: English
fr: Anglais

source: French
fr: Français

source: Restart AtmoSwing for the change to take effect.
fr: Redémarrez AtmoSwing pour que la modification prenne effet.

source: Logs
fr: Journaux

source: Errors only (recommanded)
fr: Erreurs uniquement (recommandé)

source: Display window
fr: Fenêtre d'affichage

source: Save to a file
fr: Enregistrer dans un fichier

source: Directories
fr: Répertoires

source: Directory containing archive predictors
fr: Répertoire contenant les archives de prédicteurs

source: Default predictand DB directory
fr: Répertoire contenant la base de données des prédictants

source: General
fr: Général

source: Silent (no progressbar, much faster)
fr: Silencieux (pas de barre de progression, beaucoup plus rapide)

source: Standard (recommanded)
fr: Standard (recommandé)

source: Verbose (not much used)
fr: Verbeux (peu utilisé)

source: GUI options
fr: Options de l'interface graphique

source: Let the software be responsive while processing (recommended).
fr: Laisser le logiciel réactif pendant le traitement (recommandé).

source: Allow multithreading
fr: Permettre le multithreading

source: Max nb of threads
fr: Nb max de threads

source: Threads priority
fr: Priorité des threads

source: Multithreaded (only if allowed hereabove)
fr: Multithreading (seulement si autorisé ci-dessus)

source: Standard (slower)
fr: Standard (plus lent)

source: Processing options
fr: Options de calculs

source: These options don't affect the results, only the processor efficiency.
fr: Ces options n'affectent pas les résultats, mais seulement l'efficacité du processeur.

source: Processing
fr: En cours de traitement

source: Working directories
fr: Répertoires de travail

source: Directory to save intermediate temporary results
fr: Répertoire pour l'enregistrement des résultats intermédiaires temporaires

source: User specific paths
fr: Chemins d'accès spécifiques à l'utilisateur

source: User working directory:
fr: Répertoire de travail de l'utilisateur :

source: Log file:
fr: Fichier journal :

source: Preferences file:
fr: Fichier de préférences :

source: User paths
fr: Chemins de l'utilisateur

source: Advanced
fr: Avancé
