Repository: atmoswing/atmoswing
Catalog: locales/*/app_forecaster_core.po
Languages: fr

source: Cannot open the batch file.
fr: Impossible d'ouvrir le fichier batch.

source: Errors were found in the batch file.
fr: Des erreurs ont été trouvées dans le fichier batch.

source: The file %s is not a parameters file for the Forecaster.
fr: Le fichier %s n'est pas un fichier de paramètres pour le Forecaster.

source: The date of the forecast has not been defined.
fr: La date des prévisions n'a pas été définie.

source: Processing %s...
fr: Traitement %s...

source: Processing %s
fr: Traitement %s

source: FAILED!
fr: ÉCHEC !

source: The forecast could not be processed
fr: La prévision n'a pas pu être traitée

source: done in %.1f sec.
fr: effectué en %.1f sec.

source: Processing of the forecast "%s" - "%s" took %.1f sec to execute
fr: Le traitement de la prévision "%s" - "%s" a pris %.1f secondes

source: The export of the synthetic xml failed.
fr: L'exportation du xml synthétique a échoué.

source: The export of the synthetic csv failed.
fr: L'exportation du csv synthétique a échoué.

source: Forecasting over.
fr: La prévision est terminée.

source: Forecast already exists.
fr: Les prévisions existent déjà.

source: Loading the Predictand DB.
fr: Chargement de la base de données des prédictands.

source: Predictand DB loaded.
fr: BD des prédictands chargé.

source: Exception caught: %s
fr: Une exception a été détectée : %s

source: Downloading data.
fr: Téléchargement de données.

source: Data downloaded.
fr: Données téléchargées.

source: The maximum attempts is reached to download the real-time predictor.
fr: Le nombre maximum de tentatives est atteint pour télécharger les prédicteurs prévus.

source: File not found: %s
fr: Le fichier n'a pas été trouvé : %s

source: The maximum attempts is reached to search for the real-time predictor.
fr: Le nombre maximum de tentatives est atteint pour rechercher le prédicteur prévu.

source: Directory: %s
fr: Répertoire : %s

source: The time array is not consistent in asMethodForecasting::GetAnalogsDates: size=%d.
fr: Le tableau des dates n'est pas cohérent dans asMethodForecasting::GetAnalogsDates : size=%d.

source: Date array created.
fr: Création du tableau des dates.

source: Needed memory for data: %.2f Mb (cannot evaluate available memory)
fr: Mémoire nécessaire pour les données : %.2f Mo (impossible d'évaluer la mémoire disponible)

source: Needed memory for data: %.2f Mb (%.2f Mb available)
fr: Mémoire nécessaire pour les données : %.2f Mo (%.2f Mo disponibles)

source: Data cannot fit into available memory.
fr: Les données ne tiennent pas dans la mémoire disponible.

source: Loading data (step %d, predictor nb %d).
fr: Chargement des données (étape %d, prédicteur nb %d).

source: The real-time predictor time array is not consistent (listTimeArray[%d](%f)!=timeArrayDataTarget[%d](%f)).
fr: Le tableau des dates du prédicteur prévu n'est pas cohérent (listTimeArray[%d](%f)!=timeArrayDataTarget[%d](%f)).

source: It is likely that the lead times you defined go beyond the data availability.
fr: Il est probable que les échéances que vous avez définies dépassent la disponibilité des données.

source: Data standardization is not yet implemented in operational forecasting.
fr: La normalisation des données n'est pas encore implémentée dans les prévisions opérationnelles.

source: Loading archive data.
fr: Chargement des données d'archives.

source: Archive data (%s) could not be loaded.
fr: Les données d'archive (%s) n'ont pas pu être chargées.

source: Data standardisation has failed.
fr: La normalisation des données a échoué.

source: Loading forecast data (predictorRealtime->Load).
fr: Chargement des données de prévision (predictorRealtime->Load).

source: Real-time data (%s) could not be loaded.
fr: Les prédicteurs prévus (%s) n'ont pas pu être chargées.

source: Preprocessing data (%d predictor(s)) while loading.
fr: Prétraitement des données (%d prédicteur(s)) pendant le chargement.

source: Loading predictor %d.
fr: Chargement du prédicteur %d.

source: Loading forecast data (predictorRealtimePreprocess->Load).
fr: Chargement des données de prévision (predictorRealtimePreprocess->Load).

source: Data preprocessing failed.
fr: Le prétraitement des données a échoué.

source: Data loaded
fr: Données chargées

source: Creating a criterion object.
fr: Création d'un objet critère.

source: Criterion object created.
fr: Objet de critère créé.

source: Start processing the comparison.
fr: Début du traitement de la comparaison.

source: Failed processing the analogs dates.
fr: Échec du traitement des dates analogues.

source: Creating a date arrays for the processor.
fr: Création d'un tableau de dates pour le processeur.

source: Loading data.
fr: Chargement en cours.

source: Start setting the predictand values to the corresponding analog dates.
fr: Début de l'attribution des valeurs de prédictand aux les dates analogues correspondantes.

source: Failed setting the predictand values to the corresponding analog dates.
fr: Échec de l'attribution des valeurs de prédictand aux les dates analogues correspondantes.

source: Predictands association over.
fr: L'association des prédicteurs est terminée.

source: Loading parameters file.
fr: Chargement du fichier de paramètres.

source: The given path to the parameters file is empty.
fr: Le chemin d'accès au fichier de paramètres est vide.

source: Parameters file loaded.
fr: Fichier de paramètres chargé.

source: The lead times were not provided in the parameters file.
fr: Les échéances n'ont pas été fournies dans le fichier des paramètres.

source: The beginning of the archive period was not provided in the parameters file.
fr: Le début de la période d'archive n'a pas été indiqué dans le fichier de paramètres.

source: The end of the archive period was not provided in the parameters file.
fr: La fin de la période d'archive n'a pas été indiquée dans le fichier de paramètres.

source: The time step was not provided in the parameters file.
fr: Le pas de temps n'a pas été fourni dans le fichier de paramètres.

source: The interval days for the analogs preselection was not provided in the parameters file.
fr: L'intervalle de jours pour la présélection des analogues n'a pas été fourni dans le fichier de paramètres.

source: The number of days to exclude around the target date was not provided in the parameters file.
fr: Le nombre de jours à exclure autour de la date cible n'a pas été fourni dans le fichier de paramètres.

source: The length of the analogs numbers (step %d) do not match the number of lead times.
fr: La longueur des nombres d'analogues (étape %d) ne correspond pas au nombre d'échéances.

source: The preprocessing method (step %d, predictor %d) was not provided in the parameters file.
fr: La méthode de prétraitement (étape %d, prédicteur %d) n'a pas été fournie dans le fichier de paramètres.

source: The realtime dataset for preprocessing (step %d, predictor %d) was not provided in the parameters file.
fr: Le jeu de données opérationnel pour le prétraitement (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: The realtime data for preprocessing (step %d, predictor %d) was not provided in the parameters file.
fr: Les données opérationnelles pour le prétraitement (étape %d, prédicteur %d) n'ont pas été fournies dans le fichier de paramètres.

source: The archive dataset for preprocessing (step %d, predictor %d) was not provided in the parameters file.
fr: L'ensemble de données d'archive pour le prétraitement (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: The archive data for preprocessing (step %d, predictor %d) was not provided in the parameters file.
fr: Les données d'archive pour le prétraitement (étape %d, prédicteur %d) n'ont pas été fournies dans le fichier de paramètres.

source: The realtime dataset (step %d, predictor %d) was not provided in the parameters file.
fr: L'ensemble de données opérationnelles (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: The realtime data (step %d, predictor %d) was not provided in the parameters file.
fr: Les données opérationnelles (étape %d, prédicteur %d) n'ont pas été fournies dans le fichier de paramètres.

source: The archive dataset (step %d, predictor %d) was not provided in the parameters file.
fr: L'ensemble de données d'archive (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: The archive data (step %d, predictor %d) was not provided in the parameters file.
fr: Les données d'archive (étape %d, prédicteur %d) n'ont pas été fournies dans le fichier de paramètres.

source: The grid type (step %d, predictor %d) is empty in the parameters file.
fr: Le type de grille (pas %d, prédicteur %d) est vide dans le fichier de paramètres.

source: The X points nb value (step %d, predictor %d) was not provided in the parameters file.
fr: La nombre de points en X (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: The Y points nb value (step %d, predictor %d) was not provided in the parameters file.
fr: La nombre de points en Y (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: The criteria (step %d, predictor %d) was not provided in the parameters file.
fr: Le critère (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: The lengths of the lead time and the number of analogs arrays are not consistent.
fr: Les tailles des échéances et des nombre d'analogues ne sont pas cohérentes.

source: The provided ID or the tag is empty, which isn't allowed !
fr: L'ID fourni ou la balise est vide, ce qui n'est pas autorisé !

source: Saving forecast file: %s
fr: Enregistrement du fichier de prévisions : %s

source: The forecast file was made with more recent version of AtmoSwing (file version %d.%d). It cannot be opened here.
fr: Le fichier de prévision a été réalisé avec une version plus récente d'AtmoSwing (version %d.%d). Il ne peut pas être ouvert ici.

source: The forecast file was made with an older version of AtmoSwing.
fr: Le fichier de prévision a été réalisé avec une ancienne version d'AtmoSwing.

source: The spatial aggregation could not be converted.
fr: L'agrégation spatiale n'a pas pu être convertie.

source: The forecasts "%s" and "%s" are not compatible
fr: Les prévisions "%s" et "%s" ne sont pas compatibles

source: The station ID %d was not found in the forecast results.
fr: L'ID de la station %d n'a pas été trouvé dans les résultats de la prévision.

source: This forecast has already been loaded.
fr: Cette prévision a déjà été chargée.

source: The forecast "%s" (%s) is not fully compatible with "%s" (%s)
fr: La prévision "%s" (%s) n'est pas entièrement compatible avec "%s" (%s)

source: The past forecast "%s" (%s) is not fully compatible with the current version of "%s" (%s)
fr: L'ancienne prévision "%s" (%s) n'est pas entièrement compatible avec la version actuelle de "%s" (%s)

source: No specific forecast was found for station ID %d
fr: Aucune prévision spécifique n'a été trouvée pour l'ID de la station %d

source: No specific forecast was found for station %d
fr: Aucune prévision spécifique n'a été trouvée pour la station %d

source: The desired return period is not available in the forecast file.
fr: La période de retour souhaitée n'est pas disponible dans le fichier de prévision.

source: Program already running, aborting.
fr: Programme déjà en cours d'exécution, interruption.

source: The value provided for 'forecast-past' could not be interpreted.
fr: La valeur fournie pour 'forecast-past' n'a pas pu être interprétée.

source: Wrong date format.
fr: Format de date incorrect.

source: An existing batch file was found and has been loaded.
fr: Un fichier batch existant a été trouvé et a été chargé.

source: Please provide a path to save the batch file.
fr: Veuillez indiquer un chemin d'accès pour enregistrer le fichier batch.

source: Current value (enter to keep):
fr: Valeur actuelle (entrer pour conserver) :

source: New value:
fr: Nouvelle valeur :

source: The batch file exists and will be loaded.
fr: Le fichier batch existe et sera chargé.

source: Failed opening the batch file.
fr: Échec de l'ouverture du fichier batch.

source: Please provide a directory to save the forecasts.
fr: Veuillez indiquer un répertoire où enregistrer les prévisions.

source: Do you want to export synthetic xml files of the forecasts ?
fr: Voulez-vous exporter des fichiers xml synthétiques des prévisions ?

source: New value (Y/N):
fr: Nouvelle valeur (Y/N) :

source: The provided value is not allowed. Please enter Y or N.
fr: La valeur fournie n'est pas autorisée. Veuillez saisir Y (oui) ou N (non).

source: Please provide a directory to save the exports.
fr: Veuillez indiquer un répertoire où enregistrer les exports.

source: Please provide the directory containing the parameters files.
fr: Veuillez indiquer le répertoire contenant les fichiers de paramètres.

source: Please provide the directory containing the archive predictors.
fr: Veuillez indiquer le répertoire contenant les archives de prédicteurs.

source: Please provide a directory to save the downloaded predictors.
fr: Veuillez indiquer un répertoire où enregistrer les prédicteurs téléchargés.

source: Please provide the directory containing the predictand database.
fr: Veuillez indiquer le répertoire contenant la base de données des prédictands.

source: Batch file created successfully.
fr: Fichier batch créé avec succès.

source: Warning: there is no forecast listed in the batch file. Please create the batch file on a version with the graphical interface or edit the generated file manually.
fr: Attention : le fichier batch ne contient aucune prévision. Veuillez créer le fichier batch à l'aide une version avec l'interface graphique ou éditer le fichier généré manuellement.

source: Forecast started for the %s UTC
fr: Début des prévisions pour le %s UTC

source: Failed to open the batch file
fr: Échec de l'ouverture du fichier batch

source: Failed to open the batch file %s
fr: Échec de l'ouverture du fichier batch %s

source: Please run 'atmoswing-forecaster -c' first in order to configure.
fr: Veuillez exécuter 'atmoswing-forecaster -c' en premier pour configurer le système.

source: Please run 'atmoswing-forecaster -c' first in order to configure.
fr: Veuillez exécuter 'atmoswing-forecaster -c' en premier pour configurer le système.

source: Failed processing the forecast.
fr: Échec du traitement de la prévision.

source: Failed processing the forecast.
fr: Échec du traitement de la prévision.

source: Forecast processed for the date %s UTC
fr: Prévision traitée pour la date %s UTC
