Repository: atmoswing/atmoswing
Catalog: locales/*/lib_vroomgis.po
Languages: fr

source: Rectangle not inited!
fr: Rectangle non initialisé !

source: Unsupported geometry type for modification! (%d)
fr: Type de géométrie non pris en charge pour la modification ! (%d)

source: Active vertex is : %d
fr: Le vertex actif est : %d

source: All supported formats|
fr: Tous les formats supportés|

source: Layer with same name allready exists '%s'
fr: Une couche portant le même nom existe déjà '%s'

source: Unable to Delete: '%s'. This file is still used!
fr: Impossible de supprimer : '%s'. Ce fichier est toujours utilisé !

source: Deleting '%s' Failed!
fr: La suppression de '%s' a échoué !

source: Unable to delete C2P file!
fr: Impossible de supprimer le fichier C2P !

source: Error getting geotransform data!
fr: Erreur dans l'obtention des données de géotransformation !

source: Unknown error while reading band %i from %s
fr: Erreur inconnue lors de la lecture de la bande %i de %s

source: Getting information for raster '%s' failed! This image is either empty or corrupted.
fr: L'obtention d'informations du raster '%s' a échoué ! Cette image est soit vide, soit corrompue.

source: Error creating translucency
fr: Erreur dans la création de la translucidité

source: Some metadata weren't fetched! wrong structure.
fr: Certaines métadonnées n'ont pas été récupérées ! Mauvaise structure.

source: Error going to index : %ld, (code %d)
fr: Erreur d'accès à l'index : %ld, (code %d)

source: Error deleting feature: %ld! (Error number: %d)
fr: Erreur de suppression de l'élément : %ld ! (Numéro d'erreur : %d)

source: Origin layer is empty! copying failed!
fr: La couche d'origine est vide ! La copie a échoué !

source: Error copying layer: %s
fr: Erreur de copie de la couche : %s

source: Error creating feature
fr: Erreur lors de la création des éléments

source: Object with FID: %ld has no Geometry!
fr: L'objet avec FID : %ld n'a pas de géométrie !

source: Polygon with FID: %ld has an incorrect ring (less than a vertex!). Total number of ring for that polygon is: %d
fr: Le polygone avec FID : %ld a un anneau incorrect (moins d'un vertex !). Le nombre total d'anneaux pour ce polygone est : %d

source: Error cleaning attribute filter: (code %d)
fr: Erreur de nettoyage du filtre d'attributs : (code %d)

source: Error setting following attribute filter : %s, (code %d)
fr: Erreur de l'attribution du filtre d'attribut suivant : %s, (code %d)

source: Unable to load SQLite Driver! GDAL is maybe not compiled with SQLite support
fr: Impossible de charger le pilote SQLite ! GDAL n'est peut-être pas compilé avec le support SQLite

source: Actually Profile works only on line with 2 vertex, found: %d vertex
fr: Le profile ne fonctionne que sur les lignes à 2 vertex : %d vertex trouvé

source: Unable to create profile, line is too small
fr: Impossible de créer un profil, la ligne est trop petite

source: Index out of bounds!
fr: Index hors limites !

source: Point Geometry is NULL!
fr: La géométrie des points est NULLE !

source: Line Geometry is NULL!
fr: La géométrie linéaire est NULLE !

source: Error getting point: %ld
fr: Erreur d'obtention du point : %ld

source: Date Plateform Debug Elapsed time Used Memory
fr: Date Plateforme Debug Temps écoulé Mémoire utilisée

source: Yes
fr: Oui

source: No
fr: Non

source: Unsupported geometry type: %d
fr: Type de géométrie non supporté : %d

source: Adding '%s' colour with '%d' id isn't allowed. ID allready used.
fr: L'ajout d'une couleur '%s' avec un identifiant '%d' n'est pas autorisé. L'identifiant est déjà utilisé.

source: Setting '%s' colour with '%d' id isn't allowed. ID didn't exist (dips).
fr: La définition de la couleur '%s' avec l'identifiant '%d' n'est pas autorisée. L'ID n'existait pas (dips).

source: Error, stream is in writing mode
fr: Erreur, le flux est en mode écriture

source: Nothing to read, stream empty
fr: Rien à lire, le flux est vide

source: Error trying to convert string to integer
fr: Erreur lors de la conversion d'une chaîne de caractères en un nombre entier

source: Point: %.3f, %.3f already exists
fr: Point : %.3f, %.3f existe déjà

source: Only %d vertex, unable to create polygon
fr: Seulement %d sommets, impossible de créer un polygone

source: No GIS Data
fr: Pas de données SIG

source: Couldn't apply the desired extent.
fr: Il n'a pas été possible d'appliquer l'étendue souhaitée.

source: Selection on raster isn't valid
fr: La sélection sur le raster n'est pas valide

source: Total Vector drawn: %ld
fr: Nombre de vecteurs dessinés : %ld

source: Engine not fully compatible with Linux, vector layers will not be rendered! Continue ?
fr: Le moteur n'est pas entièrement compatible avec Linux, les couches vectorielles ne seront pas affichées ! Continuer ?

source: Linux Problem
fr: Problème avec Linux

source: Add Group
fr: Ajouter un groupe

source: Set Transparency...
fr: Régler la transparence...

source: Set Pen color...
fr: Régler la couleur du stylo...

source: Set Pen width...
fr: Régler la largeur du stylo...

source: Set Brush color...
fr: Régler la couleur du pinceau...

source: Solid Brush
fr: Pinceau solide

source: Transparent Brush
fr: Pinceau transparent

source: Diagonal Brush
fr: Pinceau en diagonal

source: Brush
fr: Pinceau

source: Error getting selected layer!
fr: Erreur dans l'obtention de la couche sélectionnée !

source: Brush style not supported: %d
fr: Style de pinceau non pris en charge : %d

source: Error layer '%s' not found into ViewerLayerMaanger!
fr: Erreur couche '%s' introuvable dans ViewerLayerMaanger !

source: Case not supported!
fr: Cas non pris en charge !

source: New group
fr: Nouveau groupe

source: Error, item %d not found!!!
fr: Erreur, l'élément %d n'a pas été trouvé !!!
