Repository: atmoswing/atmoswing
Catalog: locales/*/shared_*_gui.po
Languages: fr

source: Select a file
fr: Séléctionner un fichier

source: Save to a file
fr: Enregistrer dans un fichier

source: Please wait
fr: Veuillez patienter

source: About
fr: À propos

source: Predictand database generator
fr: Générateur de la base de données du prédictand

source: The given path for the predictand catalog is empty.
fr: Le chemin d'accès au catalogue de prédictands est vide.

source: The given path for the data directory is empty.
fr: Le chemin d'accès au répertoire de données est vide.

source: The given path for the output destination is empty.
fr: Le chemin d'accès pour la destination de sortie est vide.

source: The given path for the patterns directory is empty.
fr: Le chemin d'accès au répertoire des patterns est vide.

source: Wrong selection of the temporal resolution option.
fr: Mauvaise sélection de l'option de résolution temporelle.

source: Wrong selection of the spatial aggregation option.
fr: Mauvaise sélection de l'option d'agrégation spatiale.

source: Wrong selection of the data parameter option.
fr: Mauvaise sélection de l'option de paramètre de données.

source: The given return period is not consistent.
fr: La période de retour donnée n'est pas cohérente.

source: Generic predictand database not yet implemented.
fr: La base de données générique des prédictands n'a pas encore été implémentée.

source: Exception caught: %s
fr: Une exception a été détectée : %s

source: Please select the file.
fr: Veuillez sélectionner le fichier.

source: Please select the directory and the file name.
fr: Veuillez sélectionner le répertoire et le nom du fichier.

source: Predictand parameter
fr: Paramètre du prédictand

source: Precipitation
fr: Précipitations

source: Temperature
fr: Température

source: Lightning
fr: Foudre

source: Other
fr: Autre

source: Temporal resolution
fr: Résolution temporelle

source: 24 hours
fr: 24 heures

source: 6 hours
fr: 6 heures

source: 1-hr MTW
fr: 1 heure MTW

source: 3-hr MTW
fr: 3 heures MTW

source: 6-hr MTW
fr: 6 heures MTW

source: 12-hr MTW
fr: 12 heures MTW

source: Spatial aggregation
fr: Agrégation spatiale

source: Groupment
fr: Groupement

source: Catchment
fr: Bassin versant

source: Region
fr: Région

source: Select the predictand catalog
fr: Sélectionner le catalogue de prédictands

source: Select the predictand data directory
fr: Sélectionner le répertoire de données du prédictand

source: Select a folder
fr: Sélectionner un dossier

source: Select the directory containing the file patterns description
fr: Sélectionnez le répertoire contenant la description des modèles de fichiers

source: Select the destination directory
fr: Sélectionner le répertoire de destination

source: Precipitation data normalization
fr: Normalisation des données de précipitations

source: Normalize by the return period of
fr: Normaliser par la période de retour de

source: years
fr: années

source: Process the square root
fr: Calculer la racine carrée

source: Lightning data normalization
fr: Normalisation des données de foudre

source: Process log10(nb+1)
fr: Calcul log10(nb+1)

source: Main developer:
fr: Développeur principal :

source: Developed at:
fr: Développé à :

source: University of Lausanne Terranum University of Bern
fr: Université de Lausanne Terranum Université de Berne

source: Special thanks to:
fr: Remerciements particuliers à :

source: Credits
fr: Crédits

source: License
fr: Licence
