Repository: atmoswing/atmoswing
Catalog: locales/*/shared_processing_core.po
Languages: fr

source: The predictor criteria was not correctly defined (%s).
fr: Le critère n'a pas été correctement défini (%s).

source: Absolute difference in mean value (nonspatial)
fr: Différence absolue de la valeur moyenne (non spatiale)

source: Only NaNs in the DMV criteria calculation.
fr: Seulement des NaN dans le calcul des critères DMV.

source: Difference in standard deviation (nonspatial)
fr: Différence d'écart-type (non spatial)

source: Not enough data to process the DSD score.
fr: Pas assez de données pour traiter le score DSD.

source: Mean Absolute Difference
fr: Différence moyenne absolue

source: Only NaNs in the MD criteria calculation.
fr: Seulement des NaNs dans le calcul des critères MD.

source: Root Mean Square Error
fr: Erreur quadratique moyenne

source: Only NaNs in the RMSE criteria calculation.
fr: Seulement des NaNs dans le calcul du critère RMSE.

source: Root Squared Error
fr: Erreur quadratique

source: Only NaNs in the RSE criteria calculation.
fr: Seulement des NaNs dans le calcul des critères RSE.

source: Teweles-Wobus on raw data
fr: Teweles-Wobus sur données brutes

source: Both dividend and divisor are equal to zero in the predictor criteria.
fr: Le dividende et le diviseur sont tous deux égaux à zéro dans le calcul du critère.

source: S0 with division by actual value
fr: S0 avec division par la valeur réelle

source: Teweles-Wobus score
fr: Score Teweles-Wobus

source: NaNs are not handled in with S1 without preprocessing.
fr: Les NaNs ne sont pas gérés avec S1 sans prétraitement.

source: Teweles-Wobus score with a Gaussian weighting
fr: Score de Teweles-Wobus avec une pondération gaussienne

source: Teweles-Wobus on gradients
fr: Teweles-Wobus sur les gradients

source: S1 with division by actual value
fr: S1 avec division par la valeur réelle

source: Derivative of Teweles-Wobus score
fr: Dérivée du score de Teweles-Wobus

source: NaNs are not handled in with S2 without preprocessing.
fr: Les NaNs ne sont pas gérés avec S2 sans prétraitement.

source: Sum of Absolute Differences
fr: Somme des différences absolues

source: Only NaNs in the SAD criteria calculation.
fr: Seulement ses NaNs dans le calcul du critère DAU.

source: There is no predictand database file selected.
fr: Pas de fichier de base de données de prédictants sélectionné.

source: Couldn't load the predictand database.
fr: Impossible de charger la base de données des predictands.

source: Preloading data with threads.
fr: Préchargement des données avec des threads.

source: Data preloaded with threads.
fr: Données préchargées avec des threads.

source: No data was preloaded for step %d, predictor %d and num %d.
fr: Aucune donnée n'a été préchargée pour l'étape %d, le prédicteur %d et le num %d.

source: No data was preloaded for step %d and predictor %d.
fr: Aucune donnée n'a été préchargée pour l'étape %d et le prédicteur %d.

source: Share data pointer
fr: Partage du pointeur des données

source: Preloading data for predictor %d of step %d.
fr: Préchargement des données pour le prédicteur %d de l'étape %d.

source: Adapt Y axis extent according to the maximum allowed (from %.3f to %.3f).
fr: Adapter l'étendue de l'axe Y en fonction du maximum autorisé (de %.3f à %.3f).

source: Remove %d points (%.3f-%.3f)/%.3f.
fr: Suppression de %d points (%.3f-%.3f)/%.3f.

source: Failed loading dumped data.
fr: Échec du chargement des données temporaires.

source: Loading %s data for level %d, %gh.
fr: Chargement des données %s pour le niveau %d, %gh.

source: The data (%s for level %d, at %gh) could not be loaded.
fr: Les données (%s pour le niveau %d, à %gh) n'ont pas pu être chargées.

source: Bad allocation caught during data preloading: %s
fr: Mauvaise allocation détectée lors du préchargement des données : %s

source: Exception caught during data preloading: %s
fr: Exception levée lors du préchargement des données : %s

source: Data loaded.
fr: Données chargées.

source: The preloaded data has a different length than other data series: %d != %d
fr: Les données préchargées ont une longueur différente de celle des autres séries de données : %d != %d

source: Data standardisation has failed.
fr: La normalisation des données a échoué.

source: File dumbed for %s (level %d, %gh).
fr: Fichier temporaire créé pour %s (niveau %d, %gh).

source: Preloading data for predictor preprocessed %d of step %d.
fr: Préchargement des données pour le prédicteur prétraité %d de l'étape %d.

source: Preprocessing method unknown in PreloadArchiveDataWithPreprocessing.
fr: Méthode de prétraitement inconnue dans PreloadArchiveDataWithPreprocessing.

source: Preprocessing data (%d predictor(s)) while loading.
fr: Prétraitement des données (%d prédicteur(s)) pendant le chargement.

source: Preloading data for predictor %d (preprocess %d) of step %d.
fr: Préchargement des données pour le prédicteur %d (preprocess %d) de l'étape %d.

source: Adapt Y axis extent according to the maximum allowed (from %.2f to %.2f).
fr: Adapter l'étendue de l'axe Y en fonction du maximum autorisé (de %.2f à %.2f).

source: The data could not be loaded.
fr: Les données n'ont pas pu être chargées.

source: Preprocessing data.
fr: Prétraitement des données.

source: Data preprocessing failed.
fr: Le prétraitement des données a échoué.

source: Bad allocation caught in the data preprocessing: %s
fr: Mauvaise allocation détectée lors du prétraitement des données : %s

source: Exception caught during data preprocessing: %s
fr: Une exception a été levée pendant le traitement des données : %s

source: Preprocessing over.
fr: Prétraitement terminé.

source: Could not preload the data.
fr: Impossible de précharger les données.

source: Loading data.
fr: Chargement des données en cours.

source: Data loaded
fr: Données chargées

source: Bad allocation caught during data loading: %s
fr: Mauvaise allocation détectée lors du chargement des données : %s

source: Exception caught during data loading: %s
fr: Exception lors du chargement des données : %s

source: Using preloaded data.
fr: Utilisation de données préchargées.

source: The criteria value has not been changed after the gradient preprocessing.
fr: La valeur du critère n'a pas été modifiée après le prétraitement du gradient.

source: The level (%f) could not be found in the preloaded data.
fr: Le niveau (%f) n'a pas été trouvé dans les données préchargées.

source: The hour (%d) could not be found in the preloaded data.
fr: L'heure (%d) n'a pas été trouvée dans les données préchargées.

source: The pointer to preloaded data is null.
fr: Le pointeur sur les données préchargées est nul.

source: An unexpected error occurred.
fr: Une erreur inattendue s’est produite.

source: The data could not be extracted (iStep = %d, iPtor = %d, iPre = %d, iLevel = %d, iHour = %d).
fr: Les données n'ont pas pu être extraites (iStep = %d, iPtor = %d, iPre = %d, iLevel = %d, iHour = %d).

source: The preprocessing method was not correctly defined.
fr: La méthode de prétraitement n'a pas été correctement définie.

source: The number of predictors must be equal to 1 in asPreprocessor::PreprocessGradients
fr: Le nombre de prédicteurs doit être égal à 1 dans asPreprocessor::PreprocessGradients

source: The predictor must be lat/lon to process the real gradients.
fr: Le prédicteur doit être lat/lon pour traiter les gradients réels.

source: The number of predictors must be superior to 1 in asPreprocessor::PreprocessAddition
fr: Le nombre de prédicteurs doit être supérieur à 1 dans asPreprocessor::PreprocessAddition

source: The number of predictors must be equal to 2 in asPreprocessor::PreprocessDifference
fr: Le nombre de prédicteurs doit être égal à 2 dans asPreprocessor::PreprocessDifference

source: The number of predictors must be superior to 1 in asPreprocessor::PreprocessMultiplication
fr: Le nombre de prédicteurs doit être supérieur à 1 dans asPreprocessor::PreprocessMultiplication

source: The number of predictors must be equal to 4 in asPreprocessor::PreprocessFormerHumidityIndex
fr: Le nombre de prédicteurs doit être égal à 4 dans asPreprocessor::PreprocessFormerHumidityIndex

source: The predictors sizes make them impossible to merge.
fr: La taille des prédicteurs les rend impossibles à fusionner.

source: The number of predictors must be superior to 2 in PreprocessMergeByHalfAndMultiply
fr: Le nombre de prédicteurs doit être supérieur à 2 dans PreprocessMergeByHalfAndMultiply

source: The number of predictors must be dividable by 2 in PreprocessMergeByHalfAndMultiply
fr: Le nombre de prédicteurs doit être divisible par 2 dans PreprocessMergeByHalfAndMultiply

source: The number of predictors must be equal to 4 in asPreprocessor::PreprocessHumidityFlux
fr: Le nombre de prédicteurs doit être égal à 4 dans asPreprocessor::PreprocessHumidityFlux

source: The number of predictors must be equal to 2 in asPreprocessor::PreprocessWindSpeed
fr: Le nombre de prédicteurs doit être égal à 2 dans asPreprocessor::PreprocessWindSpeed

source: The Analogs SubDates method must be called for this step.
fr: La méthode Analogs SubDates doit être appelée pour cette étape.

source: The given analog number is superior to the time series.
fr: Le nombre d'analogues donné est supérieur à la taille de la série temporelle.

source: All variables must contain the same number of members.
fr: Toutes les variables doivent contenir le même nombre de membres.

source: You cannot combine criteria that are ascendant and descendant.
fr: Vous ne pouvez pas combiner des critères croissants et décroissants.

source: Processing the data comparison.
fr: Traitement de la comparaison des données.

source: No support for ensemble datasets in CUDA yet.
fr: Pas encore de prise en charge des ensembles de données dans CUDA.

source: The CUDA implementation is only available in calibration (prefect prog).
fr: L'implémentation CUDA n'est disponible qu'en calibration (prefect prog).

source: The %s criteria is not yet implemented for CUDA.
fr: Le critère %s n'est pas encore implémenté pour CUDA.

source: The candidate (%s) was not found in the array (%s - %s) (Target date: %s).
fr: Le candidat (%s) n'a pas été trouvé dans le tableau (%s - %s) (date cible : %s).

source: NaNs were found in the criteria values.
fr: Des NaNs ont été trouvés dans les valeurs des critères.

source: Target date: %s, archive date: %s.
fr: Date cible : %s, date de l'archive : %s.

source: There is not enough available data to satisfy the number of analogs.
fr: Les données disponibles ne sont pas suffisantes pour satisfaire le nombre d'analogues.

source: Analogs number (%d) > resCounter (%d), date array size (%d) with %d days intervals.
fr: Nombre d'analogues (%d) > resCounter (%d), taille du vecteur des dates (%d) avec des intervalles de %d jours.

source: Errors were found during extraction of the analog dates.
fr: Des erreurs ont été constatées lors de l'extraction des dates analogues.

source: NaNs were found in the criteria values (%s/%s).
fr: Des NaNs ont été trouvés dans les valeurs des critères (%s/%s).

source: It should not happen that the array of analogue dates is not full when adding members.
fr: Le tableau des dates analogues devrait être plein lors de l'ajout de membres.

source: The processing method is not correctly defined.
fr: La méthode de traitement n'est pas correctement définie.

source: The function asProcessor::GetAnalogsDates took %.3f s to execute
fr: La fonction asProcessor::GetAnalogsDates a mis %.3f s à s'exécuter

source: The size of the time array and the target data are not equal (%d != %d).
fr: La taille du vecteur des dates et celle des données cibles ne sont pas égales (%d !=%d).

source: Time array starts on %s and ends on %s.
fr: Le vecteur des dates commence à %s et se termine à %s.

source: The size of the time array and the archive data are not equal (%d != %d).
fr: La taille du vecteur des dates et celle des données d'archives ne sont pas égales (%d !=%d).

source: The Analogs Dates method cannot be called first.
fr: La méthode Analogs Dates ne peut pas être appelée en premier.

source: The given analog number (%d) is superior to the previous step (%d).
fr: Le nombre d'analogues donné (%d) est supérieur à celui de l'étape précédente (%d).

source: Looking for %s in betwwen %s and %s.
fr: Recherche de %s entre %s et %s.

source: The date was not found in the array (Analogs subdates fct). That should not happen.
fr: La date n'a pas été trouvée dans le tableau (Analogs subdates fct). Cela ne devrait pas se produire.

source: The date was not found in the array (Analogs subdates fct).
fr: La date n'a pas été trouvée dans le tableau (Analogs subdates fct).

source: The function asProcessor::GetAnalogsSubDates took %.3f s to execute
fr: La fonction asProcessor::GetAnalogsSubDates a mis %.3f s à s'exécuter

source: The current analog date (%s) is outside of the allowed period (%s-%s)).
fr: La date analogue actuelle (%s) est en dehors de la période autorisée (%s-%s)).

source: The current analog date (%s) was not found in the predictand time array (%s-%s).
fr: La date analogue actuelle (%s) n'a pas été trouvée dans les predictands (%s-%s).

source: The target date array is not consistent in the temp file (last value makes no sense).
fr: Le tableau des dates cibles n'est pas cohérent dans le fichier temporaire (la dernière valeur n'a pas de sens).

source: The given time array end is superior to the time array size.
fr: La fin du tableau des dates est supérieure à sa taille.

source: The given time array end is missing its last value (end=%d, size=%d).
fr: La dernière valeur du tableau des dates est manquante (end=%d, size=%d).

source: The date was not found in the array (Analogs Dates fct, multithreaded option). That should not happen.
fr: La date n'a pas été trouvée dans le tableau (Analogues Dates fct, option multithreaded). Cela ne devrait pas se produire.

source: Start: %g, end: %g, desired value: %g.
fr: Début : %g, fin : %g, valeur souhaitée : %g.
