Repository: atmoswing/atmoswing
Catalog: locales/*/shared_*_core.po
Languages: fr

source: Setting index position in grib file.
fr: Réglage de la position de l'index dans le fichier grib.

source: Parsing grib file structure.
fr: Analyse de la structure du fichier grib.

source: The first file cannot be missing.
fr: Le premier fichier ne peut pas être manquant.

source: Missing files are handled only when there is 1 file per time step.
fr: Les fichiers manquants sont gérés uniquement lorsqu'il y a un fichier par pas de temps.

source: Variable type not supported yet for the time dimension.
fr: Le type de variable n'est pas encore pris en charge pour la dimension temporelle.

source: Time reference could not be extracted.
fr: La référence temporelle n'a pas pu être extraite.

source: Variable type not supported yet for the level dimension.
fr: Le type de variable n'est pas encore pris en charge pour la dimension du niveau (level).

source: Unknown unit for the level dimension: %s.
fr: Unité inconnue pour la dimension du niveau : %s.

source: X/longitude axis not found.
fr: Axe X/longitude introuvable.

source: Y/latitude axis not found.
fr: Axe Y/latitude introuvable.

source: Longitude axis seems not consistent (multiple breaks).
fr: L'axe des longitudes ne semble pas cohérent (plusieurs ruptures).

source: Level %f was requested and %f was found in file (single level)
fr: Le niveau %f a été demandé et %f a été trouvé dans le fichier (niveau unique)

source: Cannot find level %f
fr: Impossible de trouver le niveau %f

source: Failed at initializing the axes.
fr: Échec de l'initialisation des axes.

source: Cannot find lonMin (%f) in the array axisDataLon ([0]=%f -> [%d]=%f)
fr: Impossible de trouver lonMin (%f) dans le tableau axisDataLon ([0]=%f -> [%d]=%f)

source: The desired level (%g) does not exist for %s
fr: Le niveau souhaité (%g) n'existe pas pour %s

source: Grib files do not handle stride.
fr: Les fichiers grib ne gèrent pas les 'strides'.

source: The standardization of ensemble datasets is not yet supported.
fr: La normalisation des ensembles de données n'est pas encore prise en charge.

source: An error occurred while trying to clip data to another area (extended axis).
fr: Une erreur s'est produite lors de la découpe des données dans une autre zone (axe étendu).

source: Looking for lon %.2f and %.2f in between %.2f to %.2f.
fr: Recherche de lon %.2f et %.2f entre %.2f et %.2f.

source: An error occurred while trying to clip data to another area.
fr: Une erreur s'est produite lors de l'extraction de données vers une autre zone.

source: Looking for lat %.2f and %.2f in between %.2f to %.2f.
fr: Recherche des lattes %.2f et %.2f entre %.2f et %.2f.

source: The preprocessed area cannot be clipped to another area.
fr: La zone prétraitée ne peut pas être coupée en une autre zone.

source: Wrong axes lengths (cannot be clipped to another area).
fr: Longueurs d'axes erronées (impossibles à découper dans une autre zone).

source: Wrong preprocessing definition (cannot be clipped to another area).
fr: Mauvaise définition du prétraitement (ne peut pas être découpé dans une autre zone).

source: Interpolation not allowed on irregular grids.
fr: L'interpolation n'est pas autorisée sur les grilles irrégulières.

source: The desired point is not available in the data for interpolation. Latitude %f was not found in between %f (index %d) to %f (index %d) (size = %d).
fr: Le point souhaité n'est pas disponible dans les données pour l'interpolation. La latitude %f n'a pas été trouvée entre %f (index %d) et %f (index %d) (taille = %d).

source: The desired point is not available in the data for interpolation. Longitude %f was not found in between %f to %f.
fr: Le point souhaité n'est pas disponible dans les données pour l'interpolation. La longitude %f n'a pas été trouvée entre %f et %f.

source: The type of product must be defined for this dataset (prefix to the variable name. Ex: press/hgt).
fr: Le type de produit doit être défini pour ce jeu de données (préfixe du nom de la variable. Ex : press/hgt).

source: No '%s' parameter identified for the provided level type (%s).
fr: Aucun paramètre '%s' n'est identifié pour le type de niveau fourni (%s).

source: The provided data ID (%s) does not match any possible option in the dataset %s.
fr: L'identifiant de données fourni (%s) ne correspond à aucune option possible dans le jeu de données %s.

source: The path to the directory has not been set for the data %s from the dataset %s.
fr: Le chemin d'accès au répertoire n'a pas été défini pour les données %s du jeu de données %s.

source: Cannot find predictor directory for FVG data (%s).
fr: Impossible de trouver le répertoire des prédicteurs pour les données du FVG (%s).

source: Cannot find coherent predictor directory structure for FVG data.
fr: Impossible de trouver une structure de répertoire de prédicteurs cohérente pour les données du FVG.

source: No file found for the FVG packed archive (%s/%s).
fr: Aucun fichier n'a été trouvé pour le fichier d'archive du FVG (%s/%s).

source: The provided data ID (%s) does not match any possible option in dataset %s.
fr: L'ID de la donnée fournie (%s) ne correspond à aucune option possible dans le jeu de données %s.

source: The path to the directory has not been set for the data %s from dataset %s.
fr: Le chemin d'accès au répertoire n'a pas été défini pour les données %s du jeu de données %s.

source: level type not implemented for this reanalysis dataset.
fr: le type de niveau n'a pas été implémenté pour ce jeu de données de réanalyse.

source: No ERA5 file found.
fr: Aucun fichier ERA5 n'a été trouvé.

source: No ERA-interim file found.
fr: Aucun fichier ERA-interim n'a été trouvé.

source: No file found for the generic archive.
fr: Aucun fichier n'a été trouvé pour l'archive générique.

source: No JRA-55 file found for this pattern : %s.
fr: Aucun fichier JRA-55 n'a été trouvé pour ce pattern : %s.

source: Multiple JRA-55 files found for this pattern : %s.
fr: Plusieurs fichiers JRA-55 ont été trouvés pour ce pattern : %s.

source: Parameter '%s' not implemented yet.
fr: Le paramètre '%s' n'est pas encore implémenté.

source: Isentropic levels for CFSR are not implemented yet.
fr: Les niveaux isentropiques pour le CFSR ne sont pas encore implémentés.

source: Surface fluxes grids for CFSR are not implemented yet.
fr: Les grilles de flux de surface pour CFSR ne sont pas encore implémentées.

source: Product type not implemented for this reanalysis dataset.
fr: Type de produit non implémenté pour ce jeu de données de réanalyse.

source: Issue extracting operational predictor data: number of files and time steps do not match.
fr: Problème d'extraction des données du prédicteur opérationnel : le nombre de fichiers et les pas de temps ne correspondent pas.

source: No '%s' parameter identified.
fr: Aucun paramètre '%s' n'a été identifié.

source: File %s downloaded successfully.
fr: Fichier %s téléchargé avec succès.

source: Cannot create the thread !
fr: Impossible de créer le thread !

source: The thread array is currently full.
fr: Le liste des threads est actuellement pleine.

source: Can't run the thread!
fr: Impossible d'exécuter le thread !

source: Thread %d couldn't be removed.
fr: Le thread %d n'a pas pu être supprimé.

source: The timezone is not correctly set
fr: Le fuseau horaire n'est pas correctement défini

source: The date format is not correctly set
fr: Le format de la date n'est pas correctement défini

source: The length of the input date (%2.2d) is not as expected (%2.2d or %2.2d)
fr: La longueur de la date en entrée (%2.2d) n'est pas celle attendue (%2.2d ou %2.2d)

source: The date (%s) conversion failed. Please check the format
fr: La conversion de la date (%s) a échoué. Veuillez vérifier le format

source: Incorrect method.
fr: Méthode incorrecte.

source: Time array mode not correctly defined (%s)!
fr: Le mode de tableau des dates n'est pas correctement défini (%s) !

source: The given date is in an excluded year.
fr: La date donnée se situe dans une année exclue.

source: Time array creation failed.
fr: La création d'un tableau de dates a échoué.

source: Time array creation failed
fr: Échec de la création d'un tableau de dates

source: The time array mode is not correctly set
fr: Le mode 'time array' n'est pas correctement défini

source: The time array mode is not allowed for the analogs.
fr: Le mode du tableau des dates n'est pas autorisé pour les analogues.

source: Month '%s' not recognized.
fr: Le mois '%s' n'est pas reconnu.

source: Season not recognized.
fr: Saison non reconnue.

source: The predictand series is not correctly defined in the time array construction.
fr: La série de prédicteurs n'est pas correctement définie dans la construction du tableau des dates.

source: The day %s was not considered in the timearray due to difference in hours with %s.
fr: Le jour %s n'a pas été pris en compte dans la liste des dates en raison de la différence d'heures avec %s.

source: %d days were in the precipitation range and %d were not.
fr: %d jours se situaient dans la fourchette des précipitations et %d de jours ne s'y situaient pas.

source: The selection of the dates on the predictand threshold is empty!
fr: La sélection des dates sur la base du seuil du prédictand est vide !

source: Trying to get a date outside of the time array.
fr: Tentative d'obtention d'une date en dehors du tableau des dates.

source: The given year to remove fall outside of the time array.
fr: L'année à supprimer se situe en dehors du tableau des dates.

source: An unexpected error occurred.
fr: Une erreur inattendue s’est produite.

source: The value (%f) is out of the array range.
fr: La valeur (%f) est en dehors de la plage du tableau.

source: The value was not found in the array.
fr: La valeur n'a pas été trouvée dans le tableau.

source: Incorrect value of the order enumeration.
fr: Valeur incorrecte de l'énumération de l'ordre.

source: The dimension of the two arrays are not equal.
fr: Les dimensions des deux tableaux ne sont pas égales.

source: The array has an unique value.
fr: Le tableau a une valeur unique.

source: The array has a negative size...
fr: Le tableau a une taille négative...
