Repository: atmoswing/atmoswing
Catalog: locales/*/shared_*_core.po
Languages: fr

source: Unable to build a consistent area with the given coordinates.
fr: Impossible de construire une zone cohérente avec les coordonnées données.

source: The provided area is not rectangle.
fr: La zone fournie n'est pas un rectangle.

source: Given grid type: %s
fr: Type de grille donné : %s

source: The given grid type doesn't correspond to any existing option.
fr: Le type de grille donné ne correspond à aucune option existante.

source: Inconsistent x coordinates on a non lat / lon axis.
fr: Coordonnées x incohérentes sur un axe non lat / lon.

source: Cannot find the corresponding value (%g) on the longitude axis.
fr: Impossible de trouver la valeur correspondante (%g) sur l'axe de longitude.

source: The index (%d) of the longitude min is larger than the one for the longitude max (%d).
fr: L'indice (%d) de la longitude min est plus grand que celui de la longitude max (%d).

source: Cannot find one the corresponding value (%g or %g) on the latitude axis.
fr: Impossible de trouver la valeur correspondante (%g ou %g) sur l'axe de latitude.

source: The number of points on the latitude axis was reduced to fit the data.
fr: Le nombre de points sur l'axe des latitudes a été réduit pour s'adapter aux données.

source: A negative index was found during the area generation.
fr: Un indice négatif a été trouvé lors de la génération de la zone.

source: The number of points on the longitude axis was reduced to fit the data.
fr: Le nombre de points sur l'axe de longitude a été réduit pour s'adapter aux données.

source: No path was given for the predictand catalog.
fr: Aucun chemin n'a été donné pour le catalogue des prédictands.

source: The file path is not OK %s
fr: Le chemin d'accès au fichier n'est pas OK %s

source: The file access is not correctly set.
fr: L'accès au fichier n'est pas correctement défini.

source: The directory %s could not be created.
fr: Le répertoire %s n'a pas pu être créé.

source: Cannot find the file %s
fr: Impossible de trouver le fichier %s

source: Cannot find the directory %s
fr: Impossible de trouver le répertoire %s

source: The file could not be accessed in the desired mode.
fr: Le fichier n'a pas pu être accédé dans le mode souhaité.

source: The file should be overwritten, which is not allowed in the New mode.
fr: Le fichier devrait être écrasé, ce qui n'est pas autorisé dans le mode Nouveau.

source: Cannot open the pattern file.
fr: Impossible d'ouvrir le fichier de patterns.

source: Errors were found in the pattern file.
fr: Des erreurs ont été trouvées dans le fichier patterns.

source: The file structure type in unknown
fr: Le type de structure de fichier est inconnu

source: The file structure type in undefined
fr: Le type de structure du fichier est indéfini

source: Expecting the tag pattern in the pattern file...
fr: Attente du modèle de balise dans le fichier pattern...

source: Grib files edition is not implemented.
fr: L'édition des fichiers Grib n'est pas implémentée.

source: The ecCodes definition path '%s' was not found.
fr: Le chemin de définition de ecCodes '%s' n'a pas été trouvé.

source: Grib file found.
fr: Fichier Grib trouvé.

source: The opening of the grib file failed.
fr: L'ouverture du fichier grib a échoué.

source: Creating handle from file %s
fr: Création d'un handle à partir du fichier %s

source: Check if Grib error
fr: Vérification de potentielles erreurs liées au fichier Grib

source: Exception caught: %s
fr: Une exception a été détectée : %s

source: Failed to parse grib file (exception).
fr: Échec de l'analyse du fichier grib (exception).

source: Error reading grib file: unlisted time unit.
fr: Erreur de lecture du fichier grib : unité de temps non répertoriée.

source: Error reading grib file: type of level not found.
fr: Erreur de lecture du fichier grib : type de niveau non trouvé.

source: Grib error (file %s): %s
fr: Erreur Grib (fichier %s) : %s

source: The desired parameter / level (%.0f) was not found in the file %s.
fr: Le paramètre/niveau souhaité (%.0f) n'a pas été trouvé dans le fichier %s.

source: The file %s is empty.
fr: Le fichier %s est vide.

source: The desired parameter was not found in the file %s.
fr: Le paramètre souhaité n'a pas été trouvé dans le fichier %s.

source: Multiple messages found in GRIB file for the given constraints.
fr: Plusieurs messages ont été trouvés dans le fichier GRIB pour les contraintes données.

source: GRIB message not found for the given constraints.
fr: Message GRIB introuvable pour les contraintes données.

source: Generated by AtmoSwing
fr: Généré par AtmoSwing

source: Failed parsing the file structure.
fr: Échec de l'analyse de la structure du fichier.

source: No valid NetCdf FileMode has been selected
fr: Aucun mode de fichier NetCdf valide n'a été sélectionné

source: NetCDF error in file %s: %s
fr: Erreur NetCDF dans le fichier %s : %s

source: The desired variable doesn't exist: %s
fr: La variable souhaitée n'existe pas : %s

source: The desired attribute doesn't exist: %s
fr: L'attribut souhaité n'existe pas : %s

source: Cannot find the desired attribute in the netCDF file.
fr: Impossible de trouver l'attribut souhaité dans le fichier netCDF.

source: The attribute (%s) type (%d) in file doesn't match the desired type (%d).
fr: L'attribut (%s) de type (%d) dans le fichier ne correspond pas au type souhaité (%d).

source: Cannot find the desired variable in the netCDF file.
fr: Impossible de trouver la variable souhaitée dans le fichier netCDF.

source: The attribute (%s.%s) type (%d) in file doesn't match the desired type (%d).
fr: Le type (%s.%s) de l'attribut (%d) dans le fichier ne correspond pas au type souhaité (%d).

source: Variable name not found in the file.
fr: Le nom de la variable n'a pas été trouvé dans le fichier.

source: Cannot get the desired variable from the netCDF file.
fr: Impossible d'obtenir la variable souhaitée à partir du fichier netCDF.

source: The variable (%s) type (%d) in file doesn't match the desired type (%d).
fr: La variable (%s) de type (%d) dans le fichier ne correspond pas au type souhaité (%d).

source: The variable (%s) type (%d) in file doesn't match the desired type (numeric).
fr: La variable (%s) de type (%d) dans le fichier ne correspond pas au type souhaité (numérique).

source: Requested indices:
fr: Indices demandés :

source: NetCDF file: data type (%d) of attribute %s not taken into account in AtmoSwing.
fr: Fichier NetCDF : type de données (%d) de l'attribut %s non pris en compte dans AtmoSwing.

source: The NetCDF format is unknown
fr: Le format NetCDF est inconnu

source: Error when building a vector from the parameters file: min=%d > max=%d.
fr: Erreur lors de la construction d'un vecteur à partir du fichier de paramètres : min=%d > max=%d.

source: Error when building a vector from the parameters file: step=0.
fr: Erreur lors de la construction d'un vecteur à partir du fichier de paramètres : step=0.

source: Error when building a vector from the parameters file: min=%.2f > max=%.2f.
fr: Erreur lors de la construction d'un vecteur à partir du fichier de paramètres : min=%.2f > max=%.2f.

source: Failed at converting the value of the element %s (XML file).
fr: Échec de la conversion de la valeur de l'élément %s (fichier XML).

source: The method is not correctly defined for %s in the parameters file.
fr: La méthode n'est pas correctement définie pour %s dans le fichier de paramètres.

source: The station ID was not provided.
fr: L'identifiant de la station n'a pas été fourni.

source: The format of the station ID is not correct (more than one opening bracket).
fr: Le format de l'ID de la station n'est pas correct (plus d'une parenthèse ouvrante).

source: The format of the station ID is not correct (location of the closing bracket).
fr: Le format de l'identifiant de la station n'est pas correct (emplacement de la parenthèse fermante).

source: The format of the station ID is not correct (should be only digits).
fr: Le format de l'identifiant de la station n'est pas correct (ne doit comporter que des chiffres).

source: An error occured while trying to write in file %s
fr: Une erreur s'est produite lors de la tentative d'écriture dans le fichier %s

source: You are trying to read a line after the end of the file %s
fr: Vous essayez de lire une ligne après la fin du fichier %s

source: Reached the end of the file while skipping lines.
fr: A atteint la fin du fichier en sautant des lignes.

source: Couldn't open the file %s.
fr: Impossible d'ouvrir le fichier %s.

source: Couldn't open the xml file %s
fr: Impossible d'ouvrir le fichier xml %s

source: The file %s is for an old version of AtmoSwing and is no longer supported (root: %s).
fr: Le fichier %s correspond à une ancienne version d'AtmoSwing et n'est plus supporté (racine : %s).

source: The file %s is not an AtmoSwing file (root: %s).
fr: Le fichier %s n'est pas un fichier AtmoSwing (racine : %s).

source: The file version of %s is no longer supported.
fr: La version du fichier %s n'est plus prise en charge.

source: An unknown element was found in the file: %s
fr: Un élément inconnu a été trouvé dans le fichier : %s

source: The node is empty in the xml file.
fr: Le nœud est vide dans le fichier xml.

source: Empty %s attribute of the element %s (XML file).
fr: Attribut vide %s de l'élément %s (fichier XML).

source: Downloading file %s.
fr: Téléchargement du fichier %s.

source: The directory to save real-time predictors data cannot be created.
fr: Le répertoire d'enregistrement des données des variables prédicteurs en temps réel ne peut pas être créé.

source: Failed downloading file. Curl error code: %d
fr: Échec du téléchargement du fichier. Code d'erreur Curl : %d

source: Curl error message: %s
fr: Message d'erreur Curl : %s

source: File %d/%d downloaded successfully.
fr: Fichier %d/%d téléchargé avec succès.

source: The given path to the parameters file is empty.
fr: Le chemin d'accès au fichier de paramètres est vide.

source: The size of the provided predictors (%d) does not match the requirements (%d) in the preprocessing %s method.
fr: La taille des prédicteurs fournis (%d) ne correspond pas aux exigences (%d) de la méthode de prétraitement %s.

source: The %s preprocessing method is not yet handled with the preload option.
fr: La méthode de prétraitement %s n'est pas encore gérée par l'option preload.

source: The beginning of the archive period was not provided in the parameters file.
fr: Le début de la période d'archivage n'a pas été indiqué dans le fichier de paramètres.

source: The end of the archive period was not provided in the parameters file.
fr: La fin de la période d'archivage n'a pas été indiquée dans le fichier de paramètres.

source: The time step was not provided in the parameters file.
fr: Le pas de temps n'a pas été fourni dans le fichier de paramètres.

source: The predictand time series (for the threshold preselection) was not provided in the parameters file.
fr: La série temporelle du prédictand (pour la présélection du seuil) n'a pas été fournie dans le fichier de paramètres.

source: The provided min/max predictand thresholds are equal in the parameters file.
fr: Les seuils min/max des prédictands fournis sont égaux dans le fichier des paramètres.

source: The interval days for the analogs preselection was not provided in the parameters file.
fr: L'intervalle de jours pour la présélection des analogues n'a pas été fourni dans le fichier de paramètres.

source: The number of days to exclude around the target date was not provided in the parameters file.
fr: Le nombre de jours à exclure autour de la date cible n'a pas été fourni dans le fichier de paramètres.

source: The number of analogs (step %d) was not provided in the parameters file.
fr: Le nombre d'analogues (étape %d) n'a pas été fourni dans le fichier de paramètres.

source: The preprocessing method (step %d, predictor %d) was not provided in the parameters file.
fr: La méthode de prétraitement (étape %d, prédicteur %d) n'a pas été fournie dans le fichier de paramètres.

source: The dataset for preprocessing (step %d, predictor %d) was not provided in the parameters file.
fr: Le jeu de données pour le prétraitement (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: The data for preprocessing (step %d, predictor %d) was not provided in the parameters file.
fr: Les données pour le prétraitement (étape %d, prédicteur %d) n'ont pas été fournies dans le fichier de paramètres.

source: The dataset (step %d, predictor %d) was not provided in the parameters file.
fr: Le jeu de données (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: The data (step %d, predictor %d) was not provided in the parameters file.
fr: Les données (étape %d, prédicteur %d) n'ont pas été fournies dans le fichier de paramètres.

source: The grid type (step %d, predictor %d) is empty in the parameters file.
fr: Le type de grille (étape %d, prédicteur %d) est vide dans le fichier de paramètres.

source: The X points nb value (step %d, predictor %d) was not provided in the parameters file.
fr: La valeur nb de points en X (étape %d, prédicteur %d) n'a pas été fournie dans le fichier de paramètres.

source: The Y points nb value (step %d, predictor %d) was not provided in the parameters file.
fr: La valeur nb de points en Y (étape %d, prédicteur %d) n'a pas été fournie dans le fichier de paramètres.

source: The criteria (step %d, predictor %d) was not provided in the parameters file.
fr: Le critère (étape %d, prédicteur %d) n'a pas été fourni dans le fichier de paramètres.

source: AtmoSwing current parameters
fr: Paramètres actuels d'AtmoSwing

source: Error when parsing the parameters file
fr: Erreur lors de l'analyse du fichier de paramètres

source: The provided preload data IDs vector is empty.
fr: Le vecteur d'ID de données de préchargement fourni est vide.

source: There are empty values in the provided preload data IDs vector.
fr: Le vecteur d'ID de données de préchargement fourni contient des valeurs vides.

source: The provided preload time (hours) vector is empty.
fr: Le vecteur de temps de préchargement (heures) fourni est vide.

source: There are NaN values in the provided preload time (hours) vector.
fr: Il y a des valeurs NaN dans le vecteur de temps de préchargement (heures) fourni.

source: The provided 'preload levels' vector is empty.
fr: Le vecteur 'preload levels' fourni est vide.

source: There are NaN values in the provided 'preload levels' vector.
fr: Le vecteur 'preload levels' fourni contient des valeurs NaN.

source: Trying to access to an element outside of preprocessLevels in the parameters object.
fr: Tentative d'accès à un élément en dehors de preprocessLevels dans l'objet parameters.

source: The Parameter enumeration (%s) entry doesn't exists
fr: L'entrée de l'énumération Parameter (%s) n'existe pas

source: The given data parameter type in unknown.
fr: Le type de paramètre de données fourni est inconnu.

source: The Unit enumeration (%s) entry doesn't exists
fr: L'entrée de l'énumération Unit (%s) n'existe pas

source: The temporalResolution enumeration (%s) entry doesn't exists
fr: L'entrée de l'énumération temporalResolution (%s) n'existe pas

source: The given data temporal resolution type in unknown.
fr: Le type de résolution temporelle des données est inconnu.

source: The spatialAggregation enumeration (%s) entry doesn't exists
fr: L'entrée de l'énumération spatialAggregation (%s) n'existe pas

source: The given data spatial aggregation type in unknown.
fr: Le type d'agrégation spatiale des données est inconnu.

source: The predictand parameter is not listed in the asPredictand instance factory.
fr: Le paramètre predictand n'est pas répertorié dans la fabrique d'instance asPredictand.

source: Opening the file %s
fr: Ouverture du fichier %s

source: Couldn't open file %s
fr: Impossible d'ouvrir le fichier %s

source: The predictand DB file was made with an older version of AtmoSwing that is no longer supported. Please generate the file with the actual version.
fr: Le fichier predictand DB a été créé avec une ancienne version d'AtmoSwing qui n'est plus supportée. Veuillez générer le fichier avec la version actuelle.

source: The stations number is inferior to 1.
fr: Le nombre de stations est inférieur à 1.

source: The time length is inferior to 1.
fr: La durée est inférieure à 1.

source: Loading data from files.
fr: Chargement de données à partir de fichiers.

source: Loading data from files. File: %s
fr: Chargement de données à partir de fichiers. Fichier : %s

source: The process has been canceled by the user.
fr: Le processus a été annulé par l'utilisateur.

source: The given start date for "%s" is out of the catalog range.
fr: La date de début donnée pour "%s" est en dehors de la plage du catalogue.

source: The line length doesn't match.
fr: La longueur de la ligne ne correspond pas.

source: The time index is larger than the matrix (timeIndex = %d, m_timeLength = %d).
fr: L'index temporel est plus grand que la matrice (timeIndex = %d, m_timeLength = %d).

source: The given end date for "%s" is out of the catalog range.
fr: La date de fin donnée pour "%s" est en dehors de la plage du catalogue.

source: The length of the data in "%s / %s" is not coherent
fr: La longueur des données dans "%s / %s" n'est pas cohérente

source: The data file pattern is not correctly defined. Trying to access an element (date) after the line width.
fr: Le modèle du fichier de données n'est pas correctement défini. Tentative d'accès à un élément (date) après la largeur de ligne.

source: The data file pattern is not correctly defined.
fr: Le modèle de fichier de données n'est pas correctement défini.

source: The data file pattern is not correctly defined.Trying to access an element (hour) after the line width.
fr: Le modèle du fichier de données n'est pas correctement défini. Tentative d'accès à un élément (heure) après la largeur de ligne.

source: The data file pattern is not correctly defined.Trying to access an element (minute) after the line width.
fr: Le modèle du fichier de données n'est pas correctement défini. Tentative d'accès à un élément (minute) après la largeur de ligne.

source: The timestep for the extraction of the predictands maximums has to be a multiple of the data timestep.
fr: Le pas de temps pour l'extraction des maximums des prédictands doit être un multiple du pas de temps des données.

source: The timestep for the extraction of the predictands maximums cannot be lower than the data timestep.
fr: Le pas de temps pour l'extraction des maximums des prédictands ne peut être inférieur au pas de temps des données.

source: Predictand DB saved.
fr: BD des prédictands sauvegardée.

source: The data time steps is not correctly defined.
fr: Le pas de temps des données n'est pas correctement défini.

source: Making Gumbel adjustments.
fr: Calcul des ajustements de Gumbel.

source: Caution, a time serie is shorter than 20 years. It is too short to process a Gumbel adjustment.
fr: Attention, une série temporelle est inférieure à 20 ans. C'est trop court pour effectuer un ajustement de Gumbel.

source: Caution, a time serie is shorter than 30 years. It is a bit short to process a Gumbel adjustment.
fr: Attention, une série temporelle est plus courte que 30 ans. C'est un peu court pour effectuer un ajustement de Gumbel.

source: The data ID (%s) does not contain the level type
fr: L'ID de données (%s) ne contient pas le type de niveau

source: The requested dataset does not exist. Please correct the dataset Id.
fr: Le jeu de données demandé n'existe pas. Veuillez corriger l'identifiant du jeu de données.

source: The predictor did not initialize correctly.
fr: Le prédicteur ne s'est pas initialisé correctement.

source: Failed creating the file %s
fr: Échec de la création du fichier %s

source: Failed writing the file %s
fr: Échec de l'écriture du fichier %s

source: Failed closing the file %s
fr: Échec de la fermeture du fichier %s

source: Failed opening the file %s
fr: Échec de l'ouverture du fichier %s

source: Empty files list for %s (%s).
fr: Liste de fichiers vide pour %s (%s).

source: No wildcard is yet authorized in the path (%s)
fr: Aucun 'wildcard' n'est encore autorisé dans le chemin (%s)

source: Multiple files were found matching the name %s:
fr: Plusieurs fichiers correspondant au nom %s ont été trouvés :

source: File not found: %s
fr: Le fichier n'a pas été trouvé : %s

source: %.2f percent of the files are missing (%s, %s).
fr: %.2f pourcent des fichiers sont manquants (%s, %s).

source: Error at initialization of the predictor dataset %s.
fr: Erreur lors de l'initialisation de l'ensemble de données du prédicteur %s.

source: Files not found for %s (%s).
fr: Fichiers non trouvés pour %s (%s).

source: Predictor files found.
fr: Fichiers de prédicteurs trouvés.

source: Failing to get the file structure.
fr: Échec de l'obtention de la structure du fichier.

source: File structure parsed.
fr: Structure de fichier analysée.

source: Failing to get the desired level.
fr: Échec de l'obtention du niveau souhaité.

source: The time array is not valid to load data.
fr: Le tableau des dates n'est pas valide pour charger des données.

source: Extracting from files.
fr: Extraction à partir de fichiers.

source: Extracting data from files failed.
fr: L'extraction des données des fichiers a échoué.

source: Transforming data
fr: Transformation les données

source: Data transformation has failed.
fr: La transformation des données a échoué.

source: Interpolating predictor grid.
fr: Interpolation de la grille du prédicteur.

source: Interpolation failed.
fr: L'interpolation a échoué.

source: Loading forecast data (predictorRealtime->Load).
fr: Chargement des données de prévision (predictorRealtime->Load).

source: The date and the data array lengths do not match (time = %d and data = %d).
fr: Les longueurs des tableaux de dates et de données ne correspondent pas (time = %d et data = %d).

source: Time array starts on %s and ends on %s.
fr: Le tableau des dates commence le %s et se termine le %s.

source: Bad allocation (%s) caught when loading data %s (%s).
fr: Mauvaise allocation (%s) détectée lors du chargement des données %s (%s).

source: Failed to load data (exception).
fr: Échec du chargement des données (exception).

source: The desired timestep is smaller than the data timestep.
fr: Le pas de temps souhaité est inférieur au pas de temps des données.

source: The desired timestep is not a multiple of the data timestep.
fr: Le pas de temps souhaité n'est pas un multiple du pas de temps des données.

source: The desired startDate (%gh) is not coherent with the data properties (fractpart = %g).
fr: La date de début souhaitée (%gh) n'est pas cohérente avec les propriétés des données (fractpart = %g).

source: Predictor file type not correctly defined.
fr: Le type de fichier du prédicteur n'est pas correctement défini.

source: Opening grib file to enquire the structure.
fr: Ouverture d'un fichier grib pour en connaître la structure.

source: Setting index position in the grib file.
fr: Réglage de la position de l'index dans le fichier grib.

source: Creating an instance of the grib object to enquire the structure (2nd file).
fr: Création d'une instance de l'objet grib pour interroger la structure (2ème fichier).

source: Opening grib file to enquire the structure (2nd file).
fr: Ouverture du fichier grib pour interroger la structure (2ème fichier).

source: Setting index position in the grib file (2nd file).
fr: Réglage de la position de l'index dans le fichier grib (2e fichier).

source: Parsing the grib structure.
fr: Analyse de la structure grib.

source: Parsing the grib structure (single file).
fr: Analyse de la structure grib (fichier unique).

source: Opening the grib file.
fr: Ouverture du fichier grib.
